{"id":1474,"date":"2015-06-17T10:43:03","date_gmt":"2015-06-17T10:43:03","guid":{"rendered":"https:\/\/www.intechww.com\/?p=1474"},"modified":"2015-06-17T10:43:03","modified_gmt":"2015-06-17T10:43:03","slug":"controller-selection-criteria-keys-to-achieving-operational-excellence","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/controller-selection-criteria-keys-to-achieving-operational-excellence","title":{"rendered":"Controller selection criteria: Keys to achieving operational excellence"},"content":{"rendered":"<h2>The process of achieving operational excellence is selecting the right automation technologies that will ensure industrial processes run smoothly at the desired level of performance.<\/h2>\n<p><em>by Aneel Shehzad Baig and Taimoor Shabbir Khan, Intech Process Automation<\/em><\/p>\n<p>Operational excellence. Yes, that&#8217;s the name of the game for industrial enterprises around the world. In times of rising, intense, global competition, the rule is to keep driving towards achieving operational excellence because it assures an unassailable lead on the chasing pack-now and in the future.<\/p>\n<p><b>What does the right technology do?<\/b><\/p>\n<p>At the heart of the entire process of achieving operational excellence is selection of the right automation technologies that will ensure industrial processes run smoothly at the desired level of performance. The cost of investment in automation simply pales in front of selection of technology because the right technology will respond quickly to the changing market dynamics and, consequently, ensure a sustainable competitive advantage. The right technology selection will help minimize the total cost of ownership over the life of your industrial facility as well as help to create a system, which has the flexibility and capability to embrace the advancements of the future.<\/p>\n<p><b>Selecting the right controller&#8230; not easy!<\/b><\/p>\n<p>Thanks in large part to rapid advancements in controller technology, the functionalities are merged, and the lines between various technologies are blurred. Over the last few years, integrated safety has become a key differentiator and is among the most important selection criteria for programmable logic controllers (PLCs). In the future, we will see even more functions being integrated into PLC platforms like cyber security, which is currently considered as a separate entity.<\/p>\n<p>Hence, selection of the best technology is not as easy as it once was, whether it is for some Greenfield job or Brownfield job requiring an upgrade or a migration strategy for an entire plant. In the past, the strengths and weaknesses of various systems were well known and understood thus making the selection fairly easy. Not anymore.<\/p>\n<p>We understand the challenge companies have in selecting and implementing a solution that will best meet their plant-wide requirements. The criteria listed below will allow those involved in the selection of the control system to make quick and improved decisions to meet the exact control and business requirements.<\/p>\n<p><b>The criteria<\/b><\/p>\n<p><b>1. Integration with current installed base<\/b><\/p>\n<p>The existing installed base is one of the prime considerations when selecting a control system. Certain controller products may not be compatible with others. Making sure existing products are compatible with any new products will save time and money.<\/p>\n<p><b>2. Integration with business systems&#8217; capabilities and limitations<\/b><\/p>\n<p>Business systems are part of management reporting tools, and most companies use these. Control systems should have capabilities to work with various business system applications currently available in market. Most of such applications now work on open protocols like open connectivity (OPC). So control systems have to be at least OPC-compliant.<\/p>\n<p><b>3. Availability of support, training, and spares<\/b><\/p>\n<p>Companies face a lot of issues if they decide to use a control system that is a low-cost but unreliable brand. Brand reliability is very important, and existing customer profiles of potential brands should be available while doing the decision making part. Customer feedback and support mechanism details should be clearly checked. In addition to this, the training options and future spare parts&#8217; lifecycles should also be known.<\/p>\n<p><b>4. Product lifecycle and obsolescence<\/b><\/p>\n<p>Product lifecycle details should be available during the decision-making process. Additionally, the obsolescence of product is a major aspect to be covered while selecting a control system as this can have a financial impact if an upgrade or migration to a newer product is required.<\/p>\n<p><b>5. Standards compliance<\/b><\/p>\n<p>We have too many standards available in the market, and manufacturers are rapidly certifying themselves on these standards to promote their product features. Compliance requirement should be clear so as to look for the product having that specific compliance; e.g., if the requirement is to have a SIL3-certified system then you should only be looking for SIL3 systems rather than a general purpose PLC.<\/p>\n<p><b>6. Environmental considerations<\/b><\/p>\n<p>Certain environments may affect the operation of a controller. For example, typical controllers have an operating temperature of 32 to 130 F. If your application will include any extreme environmental conditions, or you have specific codes at your facility that must be met, you will need to either research products that meet those specifications or design the installation to meet requirements.<\/p>\n<p><b>7. Robust design and architecture<\/b><\/p>\n<p>The selected vendor should have a robust architecture of his product line. This is very useful when expanding the system and its features in the future. This helps to select the required feature or product category from the same vendor having ease of integration rather than selecting a new manufacturer and putting yourself in a difficult situation.<\/p>\n<p><b>8. Reliability and scalability<\/b><\/p>\n<p>The control system should be reliable; this can be checked from its current users. It has to have a prominent user base. Moreover, it should have scalability in terms of expansion; i.e., it should have sufficient expandability limitations to cater your future needs.<\/p>\n<p><b>9. Ease of deployment and maintenance<\/b><\/p>\n<p>Deployment should be easy, having user-friendly interface supported by decent operating manuals and documentation. This helps people work and maintain the system in a better way.<\/p>\n<p><b>10. Overall cost of ownership and viability in the long run or return on investment (ROI)<\/b><\/p>\n<p>This is one the most important points and is fully linked with financial numbers. The budget to be consumed or allocated for meeting the requirements through a control system should have a well-defined and documented ROI otherwise you might have to revisit the requirements to make the ROI heavy enough to defend the budgets.<\/p>\n<p><b>Core technical aspects to be determined before selecting a control system<\/b><\/p>\n<p>Sizing a PLC is critical to the success of your project. Too small and you may max out your I\/O on changes and additions. Too large and you may blow your budget. Make sure you leave room for expansion but don&#8217;t break the bank.<\/p>\n<p>Control system features to be considered include:<\/p>\n<ul>\n<li>Program memory requirement (estimated memory required for program)<\/li>\n<li>Scan time requirement (e.g., for safety applications, faster scan times are required)<\/li>\n<li>Memory backup requirement (memory backup through battery for a period of time in case of power outage to control system)<\/li>\n<li>Simplex or redundant controllers<\/li>\n<li>Simplex or redundant I\/O modules<\/li>\n<li>Simplex or redundant communication network<\/li>\n<li>Programming functions that are required (proportional-integral-derivative (PID), calculations, etc.)<\/li>\n<li>Local or remote I\/O module capability (whether I\/O modules will be local with PLC controller or remotely installed in field)<\/li>\n<li>User&#8217;s communication requirements (number\/purpose\/limitations of communication ports available on PLC, protocols supported like Ethernet, Modbus, and RS232, etc.)<\/li>\n<li>User&#8217;s programming language requirements (Ladder Logic, SFC, ST, FBD, C Language, etc.).<\/li>\n<\/ul>\n<p><b>Discrete devices (AC or DC) required in the system<\/b><\/p>\n<p>The number and type of devices the system will include is directly linked to the amount of I\/O that will be necessary for the system. You will need to choose a controller that supports your I\/O count requirements and has modules that support the signal types.<\/p>\n<p><b>Analog devices (voltage, current, temperature, etc.) required in the system <\/b><\/p>\n<p>The number and type of devices your system will include is directly linked to the amount of I\/O that will be necessary for your system. You will need to choose a controller that supports your I\/O count requirements and has modules that support your signal types.<\/p>\n<p><b>Specialty devices or features (high-speed counter, positioning, etc.) required in the system <\/b><\/p>\n<p>Specialty functions are not necessarily available in a controller central processing unit (CPU) or in standard I\/O modules. Understanding the special functions your system may perform will help you determine whether or not you will need to purchase additional specialty modules.<\/p>\n<p><b>Striking that right fit<\/b><\/p>\n<p>Whatever the choice may be, what must not be lost amidst the choice and the data that comes with it is the sight of the ultimate goal: achieving operational excellence. Technology is of importance, yes, but, in our opinion, not as important as striking that right fit between the requirements of the application and the offering of the supplier to address your needs both in the present and the future. We hope that this article will help in a wiser and better informed choice.<\/p>\n<p>This article was originally published on <a href=\"http:\/\/www.controleng.com\/industry-news\/more-news\/single-article\/controller-selection-criteria-keys-to-achieving-operational-excellence\/deb89f5413f6ebd07005c4b048dec438.html\">Control Engineering<\/a>; INTECH Process Automation&#8217;s content partner.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The process of achieving operational excellence is selecting the right automation technologies that will ensure industrial processes run smoothly at the desired level of performance. by Aneel Shehzad Baig and Taimoor Shabbir Khan, Intech Process Automation Operational excellence. Yes, that&#8217;s the name of the game for industrial enterprises around the world. In times of rising,&hellip;<\/p>\n","protected":false},"author":1,"featured_media":1475,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[127],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["1"],"_thumbnail_id":["1475"],"rank_math_news_sitemap_robots":["index"],"rank_math_robots":["a:1:{i:0;s:5:\"index\";}"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/1474"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=1474"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/1474\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/1475"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=1474"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=1474"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=1474"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=1474"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}