{"id":2064,"date":"2015-12-18T12:08:33","date_gmt":"2015-12-18T12:08:33","guid":{"rendered":"https:\/\/www.intechww.com\/?p=2064"},"modified":"2020-11-26T09:38:23","modified_gmt":"2020-11-26T09:38:23","slug":"intech-secures-agreement-to-deploy-leading-edge-communications-network-and-safety-systems-at-a-south-pakistani-gas-field","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intech-secures-agreement-to-deploy-leading-edge-communications-network-and-safety-systems-at-a-south-pakistani-gas-field","title":{"rendered":"INTECH secures agreement to deploy leading edge communications network and safety systems at a South Pakistani gas field"},"content":{"rendered":"<p>INTECH has secured an agreement to equip a gas field in South Pakistan with best in class communications network and safety systems.<\/p>\n<p>The client, one of the biggest operators in the country, has been making consistent efforts to introduce cutting-edge technology at the field to maximize operational efficiency and production at the gas field. The said gas field is located on the bank of River Indus in South Pakistan and operates more than 20 wells.<\/p>\n<p>Seeking effective monitoring, control and safety systems for the wells, the client desired a state-of-the-art solution from a trusted integration partner. INTECH has been serving the Pakistani Oil and Gas Market for more than a decade and has an excellent record of business operations with all the major operators in the country. INTECH was awarded the project based on the excellence of its solution and its impressive project references in Pakistan.<\/p>\n<p>For this project, INTECH will be responsible for supplying, installing, testing and commissioning of Remote Terminal Unit, Field Instruments, MTU and SCADA System. INTECH’s Dubai panel shop will indigenously design the RTUs and Field instruments. It will ensure design, performance and reliability of control systems conform to international IEC \/ ISA and End User standards. Dubai facility is located in JAFZA (Jebel Ali Free Zone) and its proximity to Asia and Middle East enables it to ensure projects in Middle East and Asia reach their completion way ahead of the target dates. INTECH’s full range of automation solutions will give the client leverage to get done with the complete project – from supply of control panels till the commissioning of RTU’s – from a single source.<\/p>\n<p>More will be reported on these pages about this project as it proceeds.<\/p>\n<p><strong>About INTECH’s <\/strong><strong>Wellhead Solutions<\/strong><\/p>\n<p>INTECH’s Wellhead Automation Solutions cover design, manufacturing, installation, commissioning and operation &amp; maintenance of Wellhead Systems in any location worldwide. Our wellhead products cover generic and custom built vendor-neutral solutions which range from hydraulic control panels and subsea master control stations to artificial lift optimization solutions, pump-off controllers, wellhead RTUs and injection skids. INTECH’s dedicated panel shops in USA and UAE help deliver UL certified panels in record times without compromising standards and quality.<\/p>\n<p>For more information visit: <a href=\"https:\/\/www.intechww.com\/skids-packages\/\">https:\/\/www.intechww.com\/skids-packages\/<\/a><\/p>\n<p>For support on your automation projects: <a href=\"https:\/\/www.intechww.com\/contact-us\/\">https:\/\/www.intechww.com\/contact-us\/<\/a><\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation Inc. is an international Control Systems engineering and Systems Integration company delivering reliable automation solutions to the Oil &amp; Gas sector since 1991. INTECH has done projects in 31 countries across 6 continents with regional offices in 13 countries, equipping it with 2000+ engineering man-years of experience. INTECH’s vendor-neutral approach and extensive experience help serve both regional and global customers with the highest standards of quality and reliability.<\/p>\n<p>INTECH covers all traditional asset classes (upstream, midstream &amp; downstream) as well as shale and buoy automation. Its wide range of solutions covers traditional control system automation as well as hydraulic (surface and sub-surface) control system automation and advanced software solutions for operations and asset management. Customers benefit from INTECH’s lump-sum turnkey solutions to save costs and increase plant productivity.<\/p>\n<p>For more information visit: <a href=\"https:\/\/www.intechww.com\">www.intechww.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>INTECH has secured an agreement to equip a gas field in South Pakistan with best in class communications network and safety systems. The client, one of the biggest operators in the country, has been making consistent efforts to introduce cutting-edge technology at the field to maximize operational efficiency and production at the gas field. The&hellip;<\/p>\n","protected":false},"author":1,"featured_media":6423,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[104,201,177,157,180],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["2"],"_my_meta_getsocialio_hide":["0"],"_edit_lock":["1606383412:2"],"_wpb_vc_js_status":["false"],"_easy_image_gallery_link_images":["off"],"_thumbnail_id":["6423"],"rank_math_news_sitemap_robots":["index"],"rank_math_robots":["a:1:{i:0;s:5:\"index\";}"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/2064"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=2064"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/2064\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/6423"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=2064"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=2064"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=2064"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=2064"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}