{"id":2542,"date":"2017-06-02T10:30:56","date_gmt":"2017-06-02T10:30:56","guid":{"rendered":"https:\/\/www.intechww.com\/?p=2542"},"modified":"2020-11-26T12:49:33","modified_gmt":"2020-11-26T12:49:33","slug":"intech-will-provide-specialized-preventive-corrective-maintenance-services-one-largest-refineries-peru","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intech-will-provide-specialized-preventive-corrective-maintenance-services-one-largest-refineries-peru","title":{"rendered":"INTECH will provide specialized preventive and corrective maintenance services for one of the largest refineries in Peru"},"content":{"rendered":"<p>INTECH will provide specialized preventive and corrective maintenance services for control and safety systems at one the largest refineries in Peru.<\/p>\n<p>The refinery, one of the largest in Peru based on production, is located in North Western Peru and is one the most important production facilities for regional and international markets producing a wide range of petroleum based products.<\/p>\n<p>INTECH will be responsible for covering the corrective and preventive maintenance needs of the DCS and ESD systems in the primary distillation unit and the PCS system in the catalytic cracking unit of the refinery. INTECH’s overall objective will be to improve the operational efficiency and operating conditions of the control systems in both the units while achieving levels of high availability. INTECH will coordinate with routine maintenance programs and stoppages, if any, programmed by the client. In addition, INTECH will also provide maintenance training to operators, supervisors and administrators on the specific systems.<\/p>\n<p>INTECH Process Automation Peru SAC will take the lead on this project; mobilizing resources from its offices in Lima and INTECH’s global HQ in Houston.<\/p>\n<p><strong>About INTECH’s Integrated Control Systems (ICS) Solutions<\/strong><\/p>\n<p>INTECH’s Integrated Control Systems offer a complete array of vendor neutral control automation and integration solutions ranging from basic Process Control, Safety, F&amp;G and Power Management applications to data networks, site security, instrument management and fully integrated control and safety systems. Our third party start-up and commissioning services ensure minimum downtime and accelerated glitch-free execution. INTECH’s ICS is a “One-Stop Automation Solution” that improves plant safety, reliability and efficiency while lowering costs and increasing returns.<\/p>\n<p>For more information visit: <a href=\"https:\/\/www.intechww.com\/automation\/integrated-control-systems\/\">https:\/\/www.intechww.com\/automation\/integrated-control-systems\/<\/a><\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation Inc. is an international Control Systems engineering and Systems Integration company delivering reliable automation solutions to the Oil &amp; Gas sector since 1991. INTECH has done projects in 31 countries across 6 continents with regional offices in 13 countries, equipping it with 2000+ engineering man-years of experience. INTECH’s vendor-neutral approach and extensive experience help serve both regional and global customers with the highest standards of quality and reliability.<\/p>\n<p>INTECH covers all traditional asset classes (upstream, midstream &amp; downstream) as well as shale and buoy automation. Its wide range of solutions covers traditional control system automation as well as hydraulic (surface and sub-surface) control system automation and advanced software solutions for operations and asset management. Customers benefit from INTECH’s lump-sum turnkey solutions to save costs and increase plant productivity.<\/p>\n<p>For more Information, visit: <a href=\"https:\/\/www.intechww.com\/\">https:\/\/www.intechww.com<\/a><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>INTECH will provide specialized preventive and corrective maintenance services for control and safety systems at one the largest refineries in Peru. The refinery, one of the largest in Peru based on production, is located in North Western Peru and is one the most important production facilities for regional and international markets producing a wide range&hellip;<\/p>\n","protected":false},"author":1,"featured_media":2543,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[197,194,104],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["2"],"_thumbnail_id":["2543"],"_my_meta_getsocialio_hide":["0"],"_yoast_wpseo_primary_category":["3"],"_edit_lock":["1613402033:2"],"_wpb_vc_js_status":["false"],"_easy_image_gallery_link_images":["off"],"rank_math_primary_category":["3"],"rank_math_news_sitemap_robots":["index"],"rank_math_robots":["a:1:{i:0;s:5:\"index\";}"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/2542"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=2542"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/2542\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/2543"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=2542"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=2542"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=2542"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=2542"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}