{"id":2561,"date":"2017-08-07T07:56:12","date_gmt":"2017-08-07T07:56:12","guid":{"rendered":"https:\/\/www.intechww.com\/?p=2561"},"modified":"2020-11-26T09:27:42","modified_gmt":"2020-11-26T09:27:42","slug":"intech-awarded-project-lead-massive-automation-drive-major-gas-field-kuwait","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intech-awarded-project-lead-massive-automation-drive-major-gas-field-kuwait","title":{"rendered":"INTECH wins multi-million dollar project to lead a massive automation drive at a major gas field in Kuwait"},"content":{"rendered":"<p>INTECH Process Automation has won a multi-million dollar project to lead a massive automation drive at a major gas field in Kuwait.<\/p>\n<p>INTECH’s client on the project is a leading regional oil and gas company and intended to expand its present gas extraction operations by automating newly developed wells as well as upgrading systems on a cluster of already developed and functional wells. INTECH emerged as the clear winner for this project based on the strength &amp; viability of its solution, its experience in executing similar large scale projects around the world as well as the compatibility &amp; capacity of its systems for any future expansions.<\/p>\n<p>INTECH’s scope in this project includes Design, Engineering, Procurement, &amp; Supply of Complete SCADA system, CCTV, RTU, ESD \/ FGS SIL-3 PLC &amp; Hydraulic Wellhead Control Panels.  The overall automation drive covers 200 well sites and will be executed in phases. In the first phase, INTECH will provide systems and services for 30 new wells and 40+ already developed wells.<\/p>\n<p>INTECH’s detailed scope on the project includes Design, Engineering &amp; Supply of:<\/p>\n<ul>\n<li>SCADA system for 200 wells including servers, clients and networking equipment.<\/li>\n<li>SIL-3 PLC Control Systems for ESD and F&amp;G Signals.<\/li>\n<li>RTUs for non-critical signals and for communication purposes at each well site.<\/li>\n<li>Wellhead Control Panels (WHCPs) for driving MSV, SSV1, SSV2, ESDV and one future valve at each well site.<\/li>\n<li>Solar Power system for complete well requirements for INTECH supplied items.<\/li>\n<li>Existing Fiber Optic Communication backbone at Base station and control rooms (SCADA + CCTV will be used).<\/li>\n<li>FAT, Integration &amp; Testing of Panels in Dubai.<\/li>\n<li>Site services including Commissioning, Pre-Commissioning, SAT, Training etc. Training will be done on site after SAT.<\/li>\n<\/ul>\n<p>INTECH will use its offices in Dubai as the lead execution office for this project and it’s Panel Shop in Jebel Ali for manufacturing the required panels.<\/p>\n<p><strong>About INTECH Wellhead Solutions<br \/>\n<\/strong><br \/>\nINTECH’s Wellhead Automation Solutions cover design, manufacturing, installation, commissioning and operation &amp; maintenance of Wellhead Systems in any location worldwide. Our wellhead products cover generic and custom built vendor-neutral solutions which range from hydraulic control panels and subsea master control stations to artificial lift optimization solutions, pump-off controllers, wellhead RTUs and injection skids. INTECH’s dedicated panel shops in USA and UAE help deliver UL certified panels in record times without compromising standards and quality.<br \/>\nFor more information about INTECH Wellhead Solutions, click here: <a href=\"https:\/\/www.intechww.com\/skids-packages\/\">https:\/\/www.intechww.com\/skids-packages\/<\/a><\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation Inc. is an international Control Systems engineering and Systems Integration company delivering reliable automation solutions to the Oil &amp; Gas sector since 1991. INTECH has done projects in 31 countries across 6 continents with regional offices in 13 countries, equipping it with 2000+ engineering man-years of experience. INTECH’s vendor-neutral approach and extensive experience help serve both regional and global customers with the highest standards of quality and reliability.<\/p>\n<p>INTECH covers all traditional asset classes (upstream, midstream &amp; downstream) as well as shale and buoy automation. Its wide range of solutions covers traditional control system automation as well as hydraulic (surface and sub-surface) control system automation and advanced software solutions for operations and asset management. Customers benefit from INTECH’s lump-sum turnkey solutions to save costs and increase plant productivity.<\/p>\n<p>For more Information, visit: <a href=\"https:\/\/www.intechww.com\/\">www.intechww.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>INTECH Process Automation has won a multi-million dollar project to lead a massive automation drive at a major gas field in Kuwait. INTECH’s client on the project is a leading regional oil and gas company and intended to expand its present gas extraction operations by automating newly developed wells as well as upgrading systems on a&hellip;<\/p>\n","protected":false},"author":1,"featured_media":2562,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[104,177,171,157,180],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["2"],"_thumbnail_id":["2562"],"_my_meta_getsocialio_hide":["0"],"_yoast_wpseo_primary_category":["3"],"_edit_lock":["1678877302:4"],"_wpb_vc_js_status":["false"],"_easy_image_gallery_link_images":["off"],"rank_math_primary_category":["3"],"rank_math_news_sitemap_robots":["index"],"rank_math_robots":["a:1:{i:0;s:5:\"index\";}"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/2561"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=2561"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/2561\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/2562"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=2561"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=2561"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=2561"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=2561"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}