{"id":2830,"date":"2018-07-06T10:32:02","date_gmt":"2018-07-06T10:32:02","guid":{"rendered":"https:\/\/www.intechww.com\/?p=2830"},"modified":"2020-11-24T13:37:27","modified_gmt":"2020-11-24T13:37:27","slug":"intech-to-enhance-operational-safety-at-oil-terminal-and-associated-pipeline-rtus-in-south-pakistan","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intech-to-enhance-operational-safety-at-oil-terminal-and-associated-pipeline-rtus-in-south-pakistan","title":{"rendered":"INTECH to enhance operational safety at oil terminal and associated pipeline &#038; RTUs in South Pakistan"},"content":{"rendered":"<p>INTECH will enhance operational safety at an oil terminal and associated pipeline &amp; RTUs in South Pakistan; replacing obsolete shut down system with latest intelligent shut down system.<\/p>\n<p>With its powerful regional presence due to a strong business and delivery network, INTECH has established itself as the leading provider of oil and gas system integration services across all streams in Pakistan. Over a period of more than 20 years, INTECH has become a name for reliability, excellence, experience, and innovation; compiling a remarkable list of successful project executions with major national and private oil and gas players in the region.<\/p>\n<p>INTECH was requested by the client, a major regional petroleum company, for provision of services at its oil terminal in the southern province of Sindh. Briefly, INTECH’s scope on this project includes replacement of the obsolete shut down system with supply, installation, and commissioning of latest intelligent shut down System which, along with the terminal, will also manage the safety function of the associated pipeline. Furthermore, INTECH will upgrade the application of RTUs which are installed at different locations along the pipeline. Further details include:<\/p>\n<ul>\n<li>Site Survey, initial documentation and compilation of latest backups<\/li>\n<li>In House engineering including hardware engineering, functional design specifications, logic upgrade, internal testing, and relevant documentation<\/li>\n<li>On Site services including dismantling of old systems, installation of new hardware, interfacing of shutdown system with SCADA, on site implementation &amp; testing of new applications, Commissioning &amp; formal hand-over, and On Site training for client personnel<\/li>\n<\/ul>\n<p>INTECH will mobilize its resources in the region from its engineering offices for the execution of this project.<\/p>\n<p><strong>About INTECH’s Integrated Control Systems (ICS) Solutions<\/strong><\/p>\n<p>INTECH’s Integrated Control Systems offer a complete array of vendor neutral control automation and integration solutions ranging from basic Process Control, Safety, F&amp;G and Power Management applications to data networks, site security, instrument management and fully integrated control and safety systems. Our third party start-up and commissioning services ensure minimum downtime and accelerated glitch-free execution. INTECH’s ICS is a “One-Stop Automation Solution” that improves plant safety, reliability and efficiency while lowering costs and increasing returns.<\/p>\n<p>For more information visit: <a href=\"https:\/\/www.intechww.com\/automation\/integrated-control-systems\/\">https:\/\/www.intechww.com\/automation\/integrated-control-systems\/<\/a><\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation Inc. is an international Control Systems engineering and Systems Integration company delivering reliable automation solutions to the Oil &amp; Gas sector since 1991. INTECH has done projects in 31 countries across 6 continents with regional offices in 13 countries, equipping it with 2000+ engineering man-years of experience. INTECH’s vendor-neutral approach and extensive experience help serve both regional and global customers with the highest standards of quality and reliability.<\/p>\n<p>INTECH covers all traditional asset classes (upstream, midstream &amp; downstream) as well as shale and buoy automation. Its wide range of solutions covers traditional control system automation as well as hydraulic (surface and sub-surface) control system automation and advanced software solutions for operations and asset management. Customers benefit from INTECH’s lump-sum turnkey solutions to save costs and increase plant productivity.<\/p>\n<p>For more Information, visit: <a href=\"https:\/\/www.intechww.com\/\">https:\/\/www.intechww.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>INTECH will enhance operational safety at an oil terminal and associated pipeline &amp; RTUs in South Pakistan; replacing obsolete shut down system with latest intelligent shut down system. With its powerful regional presence due to a strong business and delivery network, INTECH has established itself as the leading provider of oil and gas system integration&hellip;<\/p>\n","protected":false},"author":1,"featured_media":2831,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[104,201,167,157,165],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["2"],"_thumbnail_id":["2831"],"_edit_lock":["1606383404:2"],"_wpb_vc_js_status":["false"],"_easy_image_gallery_link_images":["off"],"rank_math_news_sitemap_robots":["index"],"rank_math_robots":["a:1:{i:0;s:5:\"index\";}"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/2830"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=2830"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/2830\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/2831"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=2830"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=2830"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=2830"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=2830"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}