{"id":2919,"date":"2018-10-05T09:33:54","date_gmt":"2018-10-05T09:33:54","guid":{"rendered":"https:\/\/www.intechww.com\/?p=2919"},"modified":"2020-11-26T09:45:32","modified_gmt":"2020-11-26T09:45:32","slug":"intech-will-provide-commissioning-services-for-control-systems-as-part-of-a-gas-storage-expansion-project-in-north-western-us","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intech-will-provide-commissioning-services-for-control-systems-as-part-of-a-gas-storage-expansion-project-in-north-western-us","title":{"rendered":"INTECH will provide commissioning services for control systems as part of a gas storage expansion project in North Western US"},"content":{"rendered":"<p>INTECH has been awarded a commissioning services contract for PCS &amp; SIS panels, CCTV, Access Control, and Perimeter Protection at a compressor station in North Western United States.<\/p>\n<p>INTECH’s services will be part of a natural gas storage expansion project which will enable the end user to store and integrate additional gas into its local services.<\/p>\n<p>The viability of INTECH’s solutions, excellent past project references for similar facilities and a strong working relationship with the client were instrumental in winning this project. The upcoming services work is one of a number of projects INTECH has performed for the client in the past few years, showcasing our commitment as a true automation partner to our clients.<\/p>\n<p>INTECH supplied these systems last year and its engineering team will now provide commissioning services for the said systems. INTECH’s scope on the project is now enhanced to design, engineering, supply, hardware integration, SAT, and Commissioning of PCS &amp; SIS panels (for the MCC, control Room, well pad, valve station and meter station), CCTV, Access Control, and Perimeter Protection. The breadth of automation and auxiliary systems provided are a testament to INTECH’s capability as an end-to-end automation provider, a key differentiating factor in its value proposition to clients.<\/p>\n<p>INTECH’s global HQ in Houston, TX will serve as the lead execution office for this project.<\/p>\n<p><strong>About INTECH’s Integrated Control Systems (ICS) Solutions<\/strong><\/p>\n<p>INTECH’s Integrated Control Systems offer a complete array of vendor neutral control automation and integration solutions ranging from basic Process Control, Safety, F&amp;G and Power Management applications to data networks, site security, instrument management and fully integrated control and safety systems. Our third party start-up and commissioning services ensure minimum downtime and accelerated glitch-free execution. INTECH’s ICS is a “One-Stop Automation Solution” that improves plant safety, reliability and efficiency while lowering costs and increasing returns.<\/p>\n<p>For more information visit: <a href=\"https:\/\/www.intechww.com\/automation\/integrated-control-systems\/\">https:\/\/www.intechww.com\/automation\/integrated-control-systems\/<\/a><\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation Inc. is an international Control Systems engineering and Systems Integration company delivering reliable automation solutions to the Oil &amp; Gas sector since 1991. INTECH has done projects in 31 countries across 6 continents with regional offices in 13 countries, equipping it with 2000+ engineering man-years of experience. INTECH’s vendor-neutral approach and extensive experience help serve both regional and global customers with the highest standards of quality and reliability.<\/p>\n<p>INTECH covers all traditional asset classes (upstream, midstream &amp; downstream) as well as shale and buoy automation. Its wide range of solutions covers traditional control system automation as well as hydraulic (surface and sub-surface) control system automation and advanced software solutions for operations and asset management. Customers benefit from INTECH’s lump-sum turnkey solutions to save costs and increase plant productivity.<\/p>\n<p>For more Information, visit: <a href=\"https:\/\/www.intechww.com\/\">https:\/\/www.intechww.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>INTECH has been awarded a commissioning services contract for PCS &amp; SIS panels, CCTV, Access Control, and Perimeter Protection at a compressor station in North Western United States. INTECH’s services will be part of a natural gas storage expansion project which will enable the end user to store and integrate additional gas into its local&hellip;<\/p>\n","protected":false},"author":1,"featured_media":2555,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[197,193,104,177,181],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["2"],"_thumbnail_id":["2555"],"_edit_lock":["1606383935:2"],"_wpb_vc_js_status":["false"],"_easy_image_gallery_link_images":["off"],"rank_math_news_sitemap_robots":["index"],"rank_math_robots":["a:1:{i:0;s:5:\"index\";}"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/2919"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=2919"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/2919\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/2555"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=2919"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=2919"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=2919"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=2919"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}