{"id":2951,"date":"2018-12-14T10:00:32","date_gmt":"2018-12-14T10:00:32","guid":{"rendered":"https:\/\/www.intechww.com\/?p=2951"},"modified":"2021-02-15T15:18:02","modified_gmt":"2021-02-15T15:18:02","slug":"intechs-project-team-lauded-for-its-dynamism-and-dedication-in-overcoming-challenging-milestones-completing-plant-historian-project-successfully-for-a-major-district-cooling-company-in-uae","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intechs-project-team-lauded-for-its-dynamism-and-dedication-in-overcoming-challenging-milestones-completing-plant-historian-project-successfully-for-a-major-district-cooling-company-in-uae","title":{"rendered":"INTECH’s project team lauded for its dynamism &#038; dedication in overcoming challenging milestones &#038; completing Plant Historian project successfully for a major district cooling company in UAE"},"content":{"rendered":"<p>INTECH engineers’ dynamism and dedication was highly commended as it overcame challenging milestones &amp; completed Plant Historian project successfully for a major district cooling company in UAE.<\/p>\n<p>The award of this project was <a href=\"https:\/\/goo.gl\/xtEsze\">reported earlier on these pages<\/a>. Briefly, INTECH was to provide Plant Historian Engineering, Installation, and Site services for 8 customer sites (including head office) in Phase 1 (with a foreseeable expansion of the current project to 42 customer sites in Phase 2).<\/p>\n<p>INTECH’s project engineering team carried on its tradition of overcoming challenging milestones, as it faced a very tight schedule during the execution of the project, and completed the project well-within the timelines.<\/p>\n<p>Commenting on the daunting assignment and its timely completion, the client said, &#8220;Thanks to the INTECH team for their dedication and hard work in completing this challenging milestone on time. Your engineers were up to the challenge; they were dynamic and worked for long hours to meet the highly challenging schedule. Their professionalism and devotion was crucial towards meeting our targets&#8221;<\/p>\n<p>The client, expressing its utmost satisfaction, said “I would like to thank you and your dedicated engineers for completing the project successfully. We are glad with the quality of work provided and recommend your services for future jobs. Thanks and looking forward to working with you again soon.”<\/p>\n<p>INTECH’s aim in every project is not only to address the immediate concerns but ensure that its project execution is a source of long term benefits for the client. The deployment in this project will benefit the client not only with the provision of a reliable data-repository but also in the long term in driving towards process-monitoring, condition monitoring and exception based maintenance, which will enhance overall process control and operational efficiency, as well as providing user-friendly customized dashboards, and regular line monitoring reports to ensure greater levels of transparency and information-availability at various enterprise levels.<\/p>\n<p><strong>About INTECH Advanced Software Solutions<\/strong><\/p>\n<p>INTECH offers consultancy solutions (consultancy, algorithms, technology) targeting operations, production &amp; maintenance to discover hidden efficiencies in plants’ operating envelope. Working together with the customers, INTECH helps get more out of people, processes, and technology. INTECH’s partners are directly involved with, and influence the development of virtually all industry recognized alarm management standards and other influential documents, including the ISA-18.2 standard, the API-RP-1167 recommended practice, and the EEMUA 191 guideline document.<\/p>\n<p>For more information on INTECH Advanced Software Solutions, click here: <a href=\"https:\/\/www.intechww.com\/products-and-solutions\/advanced-software-solutions\/\">https:\/\/www.intechww.com\/products-and-solutions\/advanced-software-solutions\/<\/a><\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation Inc. is an international Control Systems engineering and Systems Integration company delivering reliable automation solutions to the Oil &amp; Gas sector since 1991. INTECH has done projects in 31 countries across 6 continents with regional offices in 13 countries, equipping it with 2000+ engineering man-years of experience. INTECH’s vendor-neutral approach and extensive experience help serve both regional and global customers with the highest standards of quality and reliability.<\/p>\n<p>INTECH covers all traditional asset classes (upstream, midstream &amp; downstream) as well as shale and buoy automation. Its wide range of solutions covers traditional control system automation as well as hydraulic (surface and sub-surface) control system automation and advanced software solutions for operations and asset management. Customers benefit from INTECH’s lump-sum turnkey solutions to save costs and increase plant productivity.<\/p>\n<p>For more Information, visit: <a href=\"https:\/\/www.intechww.com\/\">www.intechww.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>INTECH engineers’ dynamism and dedication was highly commended as it overcame challenging milestones &amp; completed Plant Historian project successfully for a major district cooling company in UAE. The award of this project was reported earlier on these pages. Briefly, INTECH was to provide Plant Historian Engineering, Installation, and Site services for 8 customer sites (including&hellip;<\/p>\n","protected":false},"author":1,"featured_media":2893,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[213,104,196],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["2"],"_thumbnail_id":["2893"],"_edit_lock":["1613563361:1"],"_wpb_vc_js_status":["true"],"_easy_image_gallery_link_images":["off"],"rank_math_news_sitemap_robots":["index"],"rank_math_robots":["a:1:{i:0;s:5:\"index\";}"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/2951"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=2951"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/2951\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/2893"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=2951"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=2951"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=2951"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=2951"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}