{"id":3019,"date":"2019-04-05T10:04:14","date_gmt":"2019-04-05T10:04:14","guid":{"rendered":"https:\/\/www.intechww.com\/?p=3019"},"modified":"2020-11-26T09:25:40","modified_gmt":"2020-11-26T09:25:40","slug":"intech-will-provide-telemetry-based-scada-system-for-a-cluster-of-wells-at-a-pakistani-field","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intech-will-provide-telemetry-based-scada-system-for-a-cluster-of-wells-at-a-pakistani-field","title":{"rendered":"INTECH will provide telemetry-based SCADA system for a cluster of wells at a Pakistani field"},"content":{"rendered":"<p>INTECH will provide telemetry-based SCADA system at a Pakistani field to monitor and control a cluster of wells.<\/p>\n<p>The said field is located in the north west of Pakistan and is operated by one of the leading oil and gas companies in the country. The reserves from this field form a significant part of the hydrocarbon reserves base of the operator, INTECH’s client on this project.<\/p>\n<p>The client intended to install Telemetry based SCADA system at the field to monitor and control a cluster of producing wells through main control room within 10 km radius of Plant area. INTECH, with over its more than two decades of operations in the country, has become a leading name synonymous with reliability and innovation and was awarded the project based on its excellent working relationship with the client as well as an impressive list of similar project references.<\/p>\n<p>INTECH’s scope on this project includes:<\/p>\n<ul>\n<li>Design, engineering, configuration, testing &amp; integration of Telemetry based SCADA System, data communication equipment radio modems, towers, Master Telemetry Unit (MTU) \/ Master PLC, Solar System, integration of RTUs with communication systems and Interfacing of SCADA system with communication system through Ethernet link and\/or serial.<\/li>\n<li>Supply &amp; commissioning of Field instruments (Static Pressure Transmitters, Temperature Transmitters, Flame Detectors, Hydrocarbon detectors, CCTV system, Flow Control valves etc.).<\/li>\n<li>Installation \/ commissioning of complete SCADA Control system at several well sites and control room at Plant area as per client tender documents.<\/li>\n<li>Supply and configuration of redundant servers &amp; operator stations with HMI, web server &amp; OPC.<\/li>\n<li>Factory Acceptance Test (FAT)<\/li>\n<li>Site Acceptance Test (SAT)<\/li>\n<li>Installation &amp; Commissioning<\/li>\n<li>Onsite and Foreign Training<\/li>\n<\/ul>\n<p>INTECH will mobilize its local resources from its regional engineering offices for the execution of this project.<\/p>\n<p><strong>About INTECH Wellhead Solutions<br \/>\n<\/strong><br \/>\nINTECH’s Wellhead Automation Solutions cover design, manufacturing, installation, commissioning and operation &amp; maintenance of Wellhead Systems in any location worldwide. Our wellhead products cover generic and custom built vendor-neutral solutions which range from hydraulic control panels and subsea master control stations to artificial lift optimization solutions, pump-off controllers, wellhead RTUs and injection skids. INTECH’s dedicated panel shops in USA and UAE help deliver UL certified panels in record times without compromising standards and quality.<br \/>\nFor more information about INTECH Wellhead Solutions, click here: <a href=\"https:\/\/www.intechww.com\/skids-packages\/\">https:\/\/www.intechww.com\/skids-packages\/<\/a><\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation Inc. is an international Control Systems engineering and Systems Integration company delivering reliable automation solutions to the Oil &amp; Gas sector since 1991. INTECH has done projects in 31 countries across 6 continents with regional offices in 13 countries, equipping it with 2000+ engineering man-years of experience. INTECH’s vendor-neutral approach and extensive experience help serve both regional and global customers with the highest standards of quality and reliability.<\/p>\n<p>INTECH covers all traditional asset classes (upstream, midstream &amp; downstream) as well as shale and buoy automation. Its wide range of solutions covers traditional control system automation as well as hydraulic (surface and sub-surface) control system automation and advanced software solutions for operations and asset management. Customers benefit from INTECH’s lump-sum turnkey solutions to save costs and increase plant productivity.<\/p>\n<p>For more Information, visit: <a href=\"https:\/\/www.intechww.com\/\">www.intechww.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>INTECH will provide telemetry-based SCADA system at a Pakistani field to monitor and control a cluster of wells. The said field is located in the north west of Pakistan and is operated by one of the leading oil and gas companies in the country. The reserves from this field form a significant part of the&hellip;<\/p>\n","protected":false},"author":1,"featured_media":3020,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[104,201,177,157,180],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["2"],"_thumbnail_id":["3020"],"_edit_lock":["1606382757:2"],"_wpb_vc_js_status":["false"],"_easy_image_gallery_link_images":["off"],"rank_math_news_sitemap_robots":["index"],"rank_math_robots":["a:1:{i:0;s:5:\"index\";}"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/3019"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=3019"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/3019\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/3020"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=3019"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=3019"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=3019"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=3019"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}