{"id":3051,"date":"2019-04-19T10:29:59","date_gmt":"2019-04-19T10:29:59","guid":{"rendered":"https:\/\/www.intechww.com\/?p=3051"},"modified":"2020-11-26T09:57:56","modified_gmt":"2020-11-26T09:57:56","slug":"intech-expands-its-african-project-footprint-by-winning-a-terminal-automation-system-project-at-a-petroleum-terminal-in-tanzania","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intech-expands-its-african-project-footprint-by-winning-a-terminal-automation-system-project-at-a-petroleum-terminal-in-tanzania","title":{"rendered":"INTECH expands its African project footprint by winning a terminal automation system project at a petroleum terminal in Tanzania"},"content":{"rendered":"<p>INTECH expands its project footprint in Africa by winning a terminal automation project at a petroleum terminal in Tanzania.<\/p>\n<p>Backed by nearly two decades of business success across the African continent, encompassing hundreds of successful projects, INTECH has become synonymous with reliability and innovation in the region. INTECH’s excellent working relationship and business history with nearly all the major regional oil producers in the continent is testament to the trust that it enjoys from customers and end users; making it the integrator of choice for control and automation projects.<\/p>\n<p>As part of its cross-industry process automation program to utilize existing infrastructure at its terminals, the client has tasked INTECH to deploy a centralized Terminal Automation System which integrates with the field devices i.e. flow meters, controllers and tank gauging instrumentation along with business and billing systems. The system will also be required to integrate with custom applications like Product Ordering systems etc. in future to track and manage reconciled product inventory, stocks of its customers and automate the dispatch process via integrating with gate access control systems etc.<\/p>\n<p>INTECH will provide and integrate a fully functional terminal automation system which will host the following key features:<\/p>\n<ul>\n<li>Provision of a central Terminal Automation System (TAS)<\/li>\n<li>Remote Monitoring client at head office with inventory dashboards<\/li>\n<li>TAS application integration with business systems, existing standalone Batch Controllers, and Tank Gauging System<\/li>\n<li>Product inventory reconciliation &amp; reporting of storage and dispatched volumes; product inventory accounting including losses\/gains and allocation reporting<\/li>\n<li>Sales Orders Management with automated Bill of Lading etc. via ERP integration<\/li>\n<li>Access Control for vehicle and driver entry\/exit<\/li>\n<li>Product dispatch and receipt with Bar Code Scanners integration in TAS<\/li>\n<li>Automated loading\/dispatch control based on Sales Orders from business systems<\/li>\n<li>Centralized Repository for Product, Owners\/Customers, Allocations, and Vehicles<\/li>\n<\/ul>\n<p>INTECH’s services will provide Central Remote Monitoring of the inventory in real time, assist Terminal Team perform allocations, provide the differences and assist in optimizing inventory costs in the long run. INTECH will mobilize its resources in the region and from engineering offices for the execution of this project.<\/p>\n<p><strong>About INTECH’s Integrated Control Systems (ICS) Solutions<\/strong><\/p>\n<p>INTECH’s Integrated Control Systems offer a complete array of vendor neutral control automation and integration solutions ranging from basic Process Control, Safety, F&amp;G and Power Management applications to data networks, site security, instrument management and fully integrated control and safety systems. Our third party start-up and commissioning services ensure minimum downtime and accelerated glitch-free execution. INTECH’s ICS is a “One-Stop Automation Solution” that improves plant safety, reliability and efficiency while lowering costs and increasing returns.<\/p>\n<p>For more information visit: <a href=\"https:\/\/www.intechww.com\/automation\/integrated-control-systems\/\">https:\/\/www.intechww.com\/automation\/integrated-control-systems\/<\/a><\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation Inc. is an international Control Systems engineering and Systems Integration company delivering reliable automation solutions to the Oil &amp; Gas sector since 1991. INTECH has done projects in 31 countries across 6 continents with regional offices in 13 countries, equipping it with 2000+ engineering man-years of experience. INTECH’s vendor-neutral approach and extensive experience help serve both regional and global customers with the highest standards of quality and reliability.<\/p>\n<p>INTECH covers all traditional asset classes (upstream, midstream &amp; downstream) as well as shale and buoy automation. Its wide range of solutions covers traditional control system automation as well as hydraulic (surface and sub-surface) control system automation and advanced software solutions for operations and asset management. Customers benefit from INTECH’s lump-sum turnkey solutions to save costs and increase plant productivity.<\/p>\n<p>For more Information, visit: <a href=\"https:\/\/www.intechww.com\/\">https:\/\/www.intechww.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>INTECH expands its project footprint in Africa by winning a terminal automation project at a petroleum terminal in Tanzania. Backed by nearly two decades of business success across the African continent, encompassing hundreds of successful projects, INTECH has become synonymous with reliability and innovation in the region. INTECH’s excellent working relationship and business history with&hellip;<\/p>\n","protected":false},"author":1,"featured_media":3052,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[187,193,104,189],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["2"],"_thumbnail_id":["3052"],"_edit_lock":["1606385587:2"],"_wpb_vc_js_status":["false"],"_easy_image_gallery_link_images":["off"],"rank_math_news_sitemap_robots":["index"],"rank_math_robots":["a:1:{i:0;s:5:\"index\";}"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/3051"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=3051"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/3051\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/3052"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=3051"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=3051"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=3051"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=3051"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}