{"id":3080,"date":"2019-05-24T11:01:53","date_gmt":"2019-05-24T11:01:53","guid":{"rendered":"https:\/\/www.intechww.com\/?p=3080"},"modified":"2020-11-26T12:45:54","modified_gmt":"2020-11-26T12:45:54","slug":"intech-lands-long-term-support-contract-for-establishing-and-maintaining-a-centralized-historian-for-multiple-facilities-of-a-major-petrochemicals-company-in-saudi-arabia","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intech-lands-long-term-support-contract-for-establishing-and-maintaining-a-centralized-historian-for-multiple-facilities-of-a-major-petrochemicals-company-in-saudi-arabia","title":{"rendered":"INTECH lands long term support contract for establishing and maintaining a centralized historian for multiple facilities of a major petrochemicals company in Saudi Arabia"},"content":{"rendered":"<p>INTECH has recently secured a long-term support contract for establishing and maintaining a centralized historian for multiple manufacturing facilities at a major petrochemicals company in Saudi Arabia.<\/p>\n<p>As part of an overall digitization drive at its facilities, the client required technical support and development resources to establish a centralized historian based on OSIsoft PI System technology, build control system and historian interfaces and applications, and provide on-site and off-site maintenance services for PI Systems and their interfacing plant locations.<\/p>\n<p>INTECH has been awarded the contract based on its edge in diversified multi-vendor expertise which has resulted in years of successful business operations in Saudi Arabia. INTECH is an authorized and preferred system integration partner for OSI-PI technologies in the GCC region and has more than 10 years of real-time OSISoft PI systems’ integration experience. INTECH’s expertise, experience, and successful history of past project completions was key in winning this contract.<\/p>\n<p>INTECH will collaborate with the client’s digitization team and provide the services of its experts for system integration, maintenance, and preventive as well as reactive emergency support on and off-site. Its offering also includes provision of a dedicated software support team and a project management team to fulfil need-based call out requirements for any development, upgrade and modification works in the client’s PI and associated systems.<\/p>\n<p>INTECH’s scope of work covers the establishment and maintenance of a centralized historian for manufacturing facilities; including the following:<\/p>\n<ul>\n<li>Integration of existing and new sites with Corporate PI Servers at Head Office<\/li>\n<li>Development and configuration of PI Asset Framework as per asset hierarchy for all local plants<\/li>\n<li>Design of custom dashboards, graphics for remote monitoring and decision support<\/li>\n<li>System architecture design and recommendation for each integration as per OSIsoft and customer best practices<\/li>\n<li>PI System software maintenance and upgrades to latest releases<\/li>\n<li>Continuous updates, improvement, and enhancement of software and interfaces<\/li>\n<li>Preventive Maintenance services and Reactive On-Site Support to customer<\/li>\n<li>Exception based Alerts and Notifications for System Diagnostics<\/li>\n<li>Integration support with Enterprise Data Lake &amp; Business Systems<\/li>\n<li>Security compliance and patching as per requirement and OSIsoft best practices<\/li>\n<li>Technical support, guidance, and recommendations for continuous improvement<\/li>\n<li>Training Program for Focal Persons for Administration and Users<\/li>\n<\/ul>\n<p>INTECH will mobilize resources from its offices in Al-Khobar and regional engineering offices.<\/p>\n<p><strong>About INTECH Advanced Software Solutions<\/strong><\/p>\n<p>INTECH offers consultancy solutions (consultancy, algorithms, technology) targeting operations, production &amp; maintenance to discover hidden efficiencies in plants’ operating envelope. Working together with the customers, INTECH helps get more out of people, processes, and technology. INTECH’s partners are directly involved with, and influence the development of virtually all industry recognized alarm management standards and other influential documents, including the ISA-18.2 standard, the API-RP-1167 recommended practice, and the EEMUA 191 guideline document.<\/p>\n<p>For more information on INTECH Advanced Software Solutions, click here: <a href=\"https:\/\/www.intechww.com\/products-and-solutions\/advanced-software-solutions\/\">https:\/\/www.intechww.com\/products-and-solutions\/advanced-software-solutions\/<\/a><\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation Inc. is an international Control Systems engineering and Systems Integration company delivering reliable automation solutions to the Oil &amp; Gas sector since 1991. INTECH has done projects in 31 countries across 6 continents with regional offices in 13 countries, equipping it with 2000+ engineering man-years of experience. INTECH’s vendor-neutral approach and extensive experience help serve both regional and global customers with the highest standards of quality and reliability.<\/p>\n<p>INTECH covers all traditional asset classes (upstream, midstream &amp; downstream) as well as shale and buoy automation. Its wide range of solutions covers traditional control system automation as well as hydraulic (surface and sub-surface) control system automation and advanced software solutions for operations and asset management. Customers benefit from INTECH’s lump-sum turnkey solutions to save costs and increase plant productivity.<\/p>\n<p>For more Information, visit: <a href=\"https:\/\/www.intechww.com\/\">www.intechww.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>INTECH has recently secured a long-term support contract for establishing and maintaining a centralized historian for multiple manufacturing facilities at a major petrochemicals company in Saudi Arabia. As part of an overall digitization drive at its facilities, the client required technical support and development resources to establish a centralized historian based on OSIsoft PI System&hellip;<\/p>\n","protected":false},"author":1,"featured_media":3081,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[104,182,185,195],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["2"],"_thumbnail_id":["3081"],"_edit_lock":["1606394644:2"],"_wpb_vc_js_status":["false"],"_easy_image_gallery_link_images":["off"],"rank_math_news_sitemap_robots":["index"],"rank_math_robots":["a:1:{i:0;s:5:\"index\";}"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/3080"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=3080"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/3080\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/3081"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=3080"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=3080"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=3080"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=3080"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}