{"id":3260,"date":"2019-08-23T12:13:23","date_gmt":"2019-08-23T12:13:23","guid":{"rendered":"https:\/\/www.intechww.com\/?p=3260"},"modified":"2020-11-24T13:56:33","modified_gmt":"2020-11-24T13:56:33","slug":"intech-wins-wellhead-control-panels-project-in-iraq-will-form-a-key-part-of-well-pad-expansion-and-existing-wells-hook-up-project","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intech-wins-wellhead-control-panels-project-in-iraq-will-form-a-key-part-of-well-pad-expansion-and-existing-wells-hook-up-project","title":{"rendered":"INTECH wins wellhead control panels project in Iraq; will form a key part of well-pad expansion and existing wells hook-up project"},"content":{"rendered":"<p>INTECH has won a project for providing wellhead control panels at a major oilfield in Iraq.<\/p>\n<p>Renowned in the region for its wellhead automation prowess, INTECH was the integrator of choice for this project based on the versatility of its proposed solution and the robust reliability of its wellhead control panels. INTECH’s wellhead control panels will form a key part of the larger well-pad expansion and existing wells hook-up project.<\/p>\n<p>For this project, INTECH will be building numerous multi-well hydraulic control panels, inclusive of hydraulic power unit assembled in a skid, which will control four oil producing wells with each well having three valves. WHCP will be of Electro-Hydraulic Skid type, wherein Hydraulic power will be generated by electric pumps, and the valves will be controlled by plant ICSS.<\/p>\n<p>The project team at INTECH will also be responsible for deploying, installing and commissioning these panels as well as providing the necessary training to the client’s technical personnel.<\/p>\n<p>INTECH’s regional HQ in Dubai will lead the execution of this project and panel-building &amp; FAT will be carried out by INTECH’s Dubai panel shop.<\/p>\n<p><strong>About INTECH Wellhead Solutions<br \/>\n<\/strong><br \/>\nINTECH’s Wellhead Automation Solutions cover design, manufacturing, installation, commissioning and operation &amp; maintenance of Wellhead Systems in any location worldwide. Our wellhead products cover generic and custom built vendor-neutral solutions which range from hydraulic control panels and subsea master control stations to artificial lift optimization solutions, pump-off controllers, wellhead RTUs and injection skids. INTECH’s dedicated panel shops in USA and UAE help deliver UL certified panels in record times without compromising standards and quality.<\/p>\n<p>For more information about INTECH Wellhead Solutions, click here: <a href=\"https:\/\/www.intechww.com\/skids-packages\/\">https:\/\/www.intechww.com\/skids-packages\/<\/a><\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation Inc. is an international Control Systems engineering and Systems Integration company delivering reliable automation solutions to the Oil &amp; Gas sector since 1991. INTECH has done projects in 31 countries across 6 continents with regional offices in 13 countries, equipping it with 2000+ engineering man-years of experience. INTECH’s vendor-neutral approach and extensive experience help serve both regional and global customers with the highest standards of quality and reliability.<\/p>\n<p>INTECH covers all traditional asset classes (upstream, midstream &amp; downstream) as well as shale and buoy automation. Its wide range of solutions covers traditional control system automation as well as hydraulic (surface and sub-surface) control system automation and advanced software solutions for operations and asset management. Customers benefit from INTECH’s lump-sum turnkey solutions to save costs and increase plant productivity.<\/p>\n<p>For more Information, visit: <a href=\"https:\/\/www.intechww.com\/\">www.intechww.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>INTECH has won a project for providing wellhead control panels at a major oilfield in Iraq. Renowned in the region for its wellhead automation prowess, INTECH was the integrator of choice for this project based on the versatility of its proposed solution and the robust reliability of its wellhead control panels. INTECH’s wellhead control panels&hellip;<\/p>\n","protected":false},"author":1,"featured_media":6363,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[170,204,104,157,166,165],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["2"],"_edit_lock":["1606226194:2"],"_wpb_vc_js_status":["false"],"_easy_image_gallery_link_images":["off"],"_thumbnail_id":["6363"],"rank_math_news_sitemap_robots":["index"],"rank_math_robots":["a:1:{i:0;s:5:\"index\";}"],"rank_math_internal_links_processed":["1"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/3260"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=3260"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/3260\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/6363"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=3260"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=3260"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=3260"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=3260"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}