{"id":3351,"date":"2020-03-10T07:31:46","date_gmt":"2020-03-10T07:31:46","guid":{"rendered":"https:\/\/www.intechww.com\/?p=3351"},"modified":"2020-11-26T12:26:58","modified_gmt":"2020-11-26T12:26:58","slug":"intech-strengthens-its-saudi-arabian-presence-by-winning-a-project-for-providing-custody-transfer-metering-solution-for-one-of-the-worlds-leading-producer-of-energy-and-chemicals","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intech-strengthens-its-saudi-arabian-presence-by-winning-a-project-for-providing-custody-transfer-metering-solution-for-one-of-the-worlds-leading-producer-of-energy-and-chemicals","title":{"rendered":"INTECH strengthens its Saudi Arabian presence by winning a project for providing Custody Transfer Metering Solution for one of the world’s leading producer of energy and chemicals"},"content":{"rendered":"<p>INTECH wins a project for providing Custody Transfer Metering Solution for one of the world’s leading producer of energy and chemicals in Saudi Arabia.<\/p>\n<p>INTECH has been serving the Saudi Arabian oil and gas market for more than two decades now and has become a name that stands for reliability, availability, innovation, experience, and excellence of service. INTECH’s remarkable service history in the Kingdom includes projects with major energy players covering all assets in the oil and gas streams.<\/p>\n<p>The client intended to install new Gas Chromatographs, Flow Computers and Sampling System at two of its metering stations. INTECH will install the analyzers, flow computers and fabricate the associated analyzer shelters with all required equipment such as sample conditioning, sample probe, etc. The new equipment will be engineered, fabricated, assembled, tested and commissioned according to customer’s specifications and standards.<\/p>\n<p>INTECH’s scope on this project briefly covers the following:<\/p>\n<ul>\n<li>Sizing\/selection, supply and install Gas Chromatographs<\/li>\n<li>Sizing\/selection, supply and install Flow Computers<\/li>\n<li>Supply and installation of laboratory manual sampling station\/ sample conditioning system<\/li>\n<li>To hookup the new GCs with RTU, PLC and SCADA System<\/li>\n<li>Design, supply and install analyzer shelter<\/li>\n<li>Supply and install power, signal cabling, trays and conduits<\/li>\n<li>Site Acceptance Test &amp; Site Services covering the following scope:<\/li>\n<li>Installation of Gas Chromatograph analyser along with associated utilities<\/li>\n<li>Installation of of Flow Computers along with associated utilities<\/li>\n<li>Installation of Shelter for Gas Chromatograph<\/li>\n<li>Integration of complete system which includes Gas Chromatograph analysers, flow computers, RTUs, PLCs and SCADA.<\/li>\n<li>Commissioning of Gas Chromatograph Analyzer<\/li>\n<li>Commissioning of Flow Computers<\/li>\n<li>Training of Site Personnel<\/li>\n<li>Supply of commissioning and operational spares<\/li>\n<\/ul>\n<p>INTECH’s offices in Al Khobar will lead the execution of this project. Keeping up with its tradition of delivering projects well ahead of timelines, INTECH KSA will aim to complete this project in the latter half of 2020.<\/p>\n<p><strong>About INTECH&#8217;s Gas &amp; Liquid Measurement Solutions<\/strong><\/p>\n<p>INTECH covers the full range of engineered solutions for liquid and gas flow measurement. We provide accurate flow metering solutions for accounting and leak detection purposes. Our terminal management solutions include access control, batch measurements, custody transfer and stock reconciliation. Leak detection is accomplished using sophisticated software solutions.<\/p>\n<p>INTECH has developed specialized Oil and Gas solutions based on more than 25-years experience in the industry. We understand the criticality of liquid and gas measurement to your custody transfer, leak detection, and mass-energy balance and therefore to your entire value chain. Our customized solutions with a vendor-neutral approach sets us apart from other system integrators and OEMs.e<\/p>\n<p>For more information on INTECH&#8217;s Gas &amp; Liquid measurement solutions, click here: <a href=\"https:\/\/www.intechww.com\/products-and-solutions\/metering-storage-and-fuel-systems\/\">https:\/\/www.intechww.com\/products-and-solutions\/metering-storage-and-fuel-systems\/<\/a><\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation Inc. is an international Control Systems engineering and Systems Integration company delivering reliable automation solutions to the Oil &amp; Gas sector since 1991. INTECH has done projects in 31 countries across 6 continents with regional offices in 13 countries, equipping it with 2000+ engineering man-years of experience. INTECH’s vendor-neutral approach and extensive experience help serve both regional and global customers with the highest standards of quality and reliability.<\/p>\n<p>INTECH covers all traditional asset classes (upstream, midstream &amp; downstream) as well as shale and buoy automation. Its wide range of solutions covers traditional control system automation as well as hydraulic (surface and sub-surface) control system automation and advanced software solutions for operations and asset management. Customers benefit from INTECH’s lump-sum turnkey solutions to save costs and increase plant productivity.<\/p>\n<p>For more Information, visit: <a href=\"https:\/\/www.intechww.com\/\">www.intechww.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>INTECH wins a project for providing Custody Transfer Metering Solution for one of the world’s leading producer of energy and chemicals in Saudi Arabia. INTECH has been serving the Saudi Arabian oil and gas market for more than two decades now and has become a name that stands for reliability, availability, innovation, experience, and excellence&hellip;<\/p>\n","protected":false},"author":1,"featured_media":3352,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[186,187,188,104,195,203],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["2"],"_thumbnail_id":["3352"],"_edit_lock":["1606393619:2"],"_wpb_vc_js_status":["false"],"_easy_image_gallery_link_images":["off"],"rank_math_news_sitemap_robots":["index"],"rank_math_robots":["a:1:{i:0;s:5:\"index\";}"],"rank_math_internal_links_processed":["1"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/3351"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=3351"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/3351\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/3352"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=3351"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=3351"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=3351"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=3351"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}