{"id":3379,"date":"2020-07-20T08:44:24","date_gmt":"2020-07-20T08:44:24","guid":{"rendered":"https:\/\/www.intechww.com\/?p=3379"},"modified":"2020-11-24T12:47:14","modified_gmt":"2020-11-24T12:47:14","slug":"intech-lands-mega-deal-for-modernizing-process-control-and-safety-systems-for-a-facility-in-one-of-the-worlds-deepest-oil-producing-super-giant-fields","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intech-lands-mega-deal-for-modernizing-process-control-and-safety-systems-for-a-facility-in-one-of-the-worlds-deepest-oil-producing-super-giant-fields","title":{"rendered":"INTECH lands mega deal for modernizing process control and safety systems for a facility in one of the world’s deepest oil producing super giant fields"},"content":{"rendered":"<p>INTECH agreed terms in a mega deal for modernizing process control and safety systems for a facility in one of the world’s deepest oil producing super giant fields in Kazakhstan.<\/p>\n<p>INTECH’s decade-long history of successful project executions at various locations in Kazakhstan, with multiple projects delivered in the same oil field over the last few years, has cemented its position as one of the leading integrators in Kazakhstan and therefore was the integrator of choice for this project.<\/p>\n<p>The existing system architecture at the facility was not up to the modern requirements related to segregation of monitoring\/control functions and safety functions (emergency shutdown). The client required construction of new Remote Instrument Enclosure (RIE) at the facility to bring the automatic system of emergency protection (SIS) and PCS in conformity with its latest standards. The segregation of PCS and SIS systems will provide required reliability and safety at the said facility.<\/p>\n<p>INTECH will provide design, engineering, fabrication, and supply of new remote instrument enclosure (RIE) with PCS, SIS\/F&amp;G, industrial grade UPS system &amp; HVAC systems, and related equipment. The existing system lacked scalability and could not be upgraded. INTECH will provide new, functionally separate systems to meet the client’s objective of conforming to the latest operating and safety standards for process units.<\/p>\n<p><strong>How we are responding to COVID 19:<\/strong> We are ensuring that our services and business agreements are executed to the satisfaction of our clients and partners without exposing anyone to COVID 19. Our factories are operational with significant new safety measures. We have devised a global COVID 19 plan that covers international movement, precautions, behavioral changes, and contingency &amp; emergency response options for all our business regions.<\/p>\n<p>If you are an INTECH client and have not received information about our business continuity plans, please feel free to reach out to an INTECH account manager or project manager.<\/p>\n<p><strong>About INTECH’s Integrated Control Systems (ICS) Solutions<\/strong><\/p>\n<p>INTECH’s Integrated Control Systems offer a complete array of vendor neutral control automation and integration solutions ranging from basic Process Control, Safety, F&amp;G and Power Management applications to data networks, site security, instrument management and fully integrated control and safety systems. Our third party start-up and commissioning services ensure minimum downtime and accelerated glitch-free execution. INTECH’s ICS is a “One-Stop Automation Solution” that improves plant safety, reliability and efficiency while lowering costs and increasing returns.<\/p>\n<p>For more information visit: <a href=\"https:\/\/www.intechww.com\/automation\/integrated-control-systems\/\">https:\/\/www.intechww.com\/automation\/integrated-control-systems\/<\/a><\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation Inc. is an international Control Systems engineering and Systems Integration company delivering reliable automation solutions to the Oil &amp; Gas sector since 1991. INTECH has done projects in 31 countries across 6 continents with regional offices in 13 countries, equipping it with 2000+ engineering man-years of experience. INTECH’s vendor-neutral approach and extensive experience help serve both regional and global customers with the highest standards of quality and reliability.<\/p>\n<p>INTECH covers all traditional asset classes (upstream, midstream &amp; downstream) as well as shale and buoy automation. Its wide range of solutions covers traditional control system automation as well as hydraulic (surface and sub-surface) control system automation and advanced software solutions for operations and asset management. Customers benefit from INTECH’s lump-sum turnkey solutions to save costs and increase plant productivity.<\/p>\n<p>For more Information, visit: <a href=\"https:\/\/www.intechww.com\/\">https:\/\/www.intechww.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>INTECH agreed terms in a mega deal for modernizing process control and safety systems for a facility in one of the world’s deepest oil producing super giant fields in Kazakhstan. INTECH’s decade-long history of successful project executions at various locations in Kazakhstan, with multiple projects delivered in the same oil field over the last few&hellip;<\/p>\n","protected":false},"author":1,"featured_media":3380,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[158,198,104,159,160,157],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["2"],"_thumbnail_id":["3380"],"_edit_lock":["1606393412:2"],"_wpb_vc_js_status":["false"],"_easy_image_gallery_link_images":["off"],"rank_math_news_sitemap_robots":["index"],"rank_math_robots":["a:1:{i:0;s:5:\"index\";}"],"rank_math_internal_links_processed":["1"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/3379"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=3379"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/3379\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/3380"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=3379"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=3379"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=3379"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=3379"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}