{"id":7324,"date":"2021-04-09T11:36:08","date_gmt":"2021-04-09T11:36:08","guid":{"rendered":"https:\/\/www.intechww.com\/?p=7324"},"modified":"2021-04-09T11:36:08","modified_gmt":"2021-04-09T11:36:08","slug":"intech-is-modernizing-control-and-safety-systems-at-offshore-facilities-in-two-major-angolan-oilfields","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intech-is-modernizing-control-and-safety-systems-at-offshore-facilities-in-two-major-angolan-oilfields","title":{"rendered":"INTECH is modernizing control and safety systems at offshore facilities in two major Angolan oilfields"},"content":{"rendered":"<section class=\"wpb-content-wrapper\">[vc_row][vc_column][vc_column_text]INTECH is carrying out control and safety systems upgrades at an offshore platform and a gathering station in two of the largest producing oilfields in Angolan waters.<\/p>\n<p>INTECH is completing nearly two decades of successful business in Angola with more than a hundred successful projects. INTECH’s remarkable project references, consistent proof of expertise, and a long history of successful project completions with the client in Angola and around the world, enabled it to be in pole position for winning this project.<\/p>\n<p>Owing to obsolescence and declining availability of spares &amp; OEM support, the client wished to upgrade its process control &amp; safety systems to the latest versions. The scope of work on this project includes:<\/p>\n<ul>\n<li>Design &amp; Engineering of PCS, SIS\/F&amp;G, and SCADA<\/li>\n<li>HMI development as per guidelines<\/li>\n<li>Panel fabrication &amp; assembly<\/li>\n<li>System staging &amp; FAT<\/li>\n<li>Site mobilization and Commissioning<\/li>\n<\/ul>\n<p>INTECH will mobilize resources from its Luanda offices and regional HQ in Dubai for the execution of this project.<\/p>\n<p><strong>How we are responding to COVID 19:<\/strong> We are ensuring that our services and business agreements are executed to the satisfaction of our clients and partners without exposing anyone to COVID 19. Our factories are operational with significant new safety measures. We have devised a global COVID 19 plan that covers international movement, precautions, behavioral changes, and contingency &amp; emergency response options for all our business regions.<\/p>\n<p>If you are an INTECH client and have not received information about our business continuity plans, please feel free to reach out to an INTECH account manager or project manager.<\/p>\n<p><strong>About INTECH’s Integrated Control Systems (ICS) Solutions<\/strong><\/p>\n<p>INTECH’s Integrated Control Systems offer a complete array of vendor neutral control automation and integration solutions ranging from basic Process Control, Safety, F&amp;G and Power Management applications to data networks, site security, instrument management and fully integrated control and safety systems. Our third-party start-up and commissioning services ensure minimum downtime and accelerated glitch-free execution. INTECH’s ICS is a “One-Stop Automation Solution” that improves plant safety, reliability and efficiency while lowering costs and increasing returns.<\/p>\n<p>For more information visit: <a href=\"https:\/\/www.intechww.com\/automation\/integrated-control-systems\/\">https:\/\/www.intechww.com\/automation\/integrated-control-systems\/<\/a><\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation Inc. is an international Control Systems engineering and Systems Integration company delivering reliable automation solutions to the Oil &amp; Gas sector since 1991. INTECH has done projects in 31 countries across 6 continents with regional offices in 13 countries, equipping it with 2000+ engineering man-years of experience. INTECH’s vendor-neutral approach and extensive experience help serve both regional and global customers with the highest standards of quality and reliability.<\/p>\n<p>INTECH covers all traditional asset classes (upstream, midstream &amp; downstream) as well as shale and buoy automation. Its wide range of solutions covers traditional control system automation as well as hydraulic (surface and sub-surface) control system automation and advanced software solutions for operations and asset management. Customers benefit from INTECH’s lump-sum turnkey solutions to save costs and increase plant productivity.<\/p>\n<p>For more Information, visit: <a href=\"https:\/\/www.intechww.com\/\">https:\/\/www.intechww.com\/<\/a>[\/vc_column_text][\/vc_column][\/vc_row]\n<\/section>","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column][vc_column_text]INTECH is carrying out control and safety systems upgrades at an offshore platform and a gathering station in two of the largest producing oilfields in Angolan waters. INTECH is completing nearly two decades of successful business in Angola with more than a hundred successful projects. INTECH’s remarkable project references, consistent proof of expertise, and a&hellip;<\/p>\n","protected":false},"author":4,"featured_media":7326,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[156,161,158,104,159,160,177],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["2"],"_wpb_vc_js_status":["true"],"_easy_image_gallery_link_images":["off"],"_edit_lock":["1619606885:1"],"_thumbnail_id":["7326"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/7324"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=7324"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/7324\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/7326"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=7324"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=7324"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=7324"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=7324"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}