{"id":7466,"date":"2021-07-06T10:35:45","date_gmt":"2021-07-06T10:35:45","guid":{"rendered":"https:\/\/www.intechww.com\/?p=7466"},"modified":"2021-12-23T06:19:00","modified_gmt":"2021-12-23T06:19:00","slug":"intechs-systems-and-experts-help-improve-drinking-water-supply-with-the-expansion-of-a-key-middle-eastern-water-plant","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intechs-systems-and-experts-help-improve-drinking-water-supply-with-the-expansion-of-a-key-middle-eastern-water-plant","title":{"rendered":"INTECH’s systems and experts help improve drinking water supply with the expansion of a key Middle Eastern water plant"},"content":{"rendered":"<section class=\"wpb-content-wrapper\">[vc_row][vc_column][vc_column_text]INTECH’s systems and experts are helping in expanding a key Middle Eastern water plant to improve the <a style=\"text-decoration: none; color: #616161;\" href=\"http:\/\/www.shapesfoundation.org\" target=\"_blank\" rel=\"external noopener\">drinking water<\/a> supply in its host region.<\/p>\n<p>INTECH’s multi-vendor expertise and its strategically placed manufacturing facilities have enabled it to become the technology partner of choice for major Oil &amp; Gas companies in MEA region. The ever-increasing trust from INTECH’s existing clientele has resulted in other important segments of the industrial value chain, like Power, Utilities, and FMCGs, seeking INTECH’s automation and control expertise for their facilities.<\/p>\n<p>INTECH’s client on this project sought INTECH’s services to expand the water plant by bringing online new water supply &amp; storage areas and upgrading technology as well as replacing systems at the existing areas, as required. INTECH’s panels, built on the latest control technology and standards, will help in improving remote monitoring, diagnostics, and management efficiencies of client’s assets, lowering the total cost of ownership. INTECH’s control system and field instrumentation experts will integrate the new and upgraded systems with the plant’s existing communication network for round-the-clock operations and monitoring. In addition to complete end-to-end services for this upgrade, INTECH will also be providing the client O&amp;M training.<\/p>\n<p><strong>How we are responding to COVID 19:<\/strong> We are ensuring that our services and business agreements are executed to the satisfaction of our clients and partners without exposing anyone to COVID 19. Our factories are operational with significant new safety measures. We have devised a global COVID 19 plan that covers international movement, precautions, behavioral changes, and contingency &amp; emergency response options for all our business regions.<\/p>\n<p>If you are an INTECH client and have not received information about our business continuity plans, please feel free to reach out to an INTECH account manager or project manager.<\/p>\n<p><strong>About INTECH’s Integrated Control Systems (ICS) Solutions<\/strong><\/p>\n<p>INTECH’s Integrated Control Systems offer a complete array of vendor-neutral control automation and integration solutions ranging from basic Process Control, Safety, F&amp;G and Power Management applications to data networks, site security, instrument management, and distributed control and safety systems. Our third-party start-up and commissioning services ensure minimum downtime and accelerated glitch-free execution. INTECH’s ICS is a “One-Stop Automation Solution” that improves plant safety, reliability, and efficiency while lowering costs and increasing returns. For more information visit: https:\/\/www.intechww.com\/automation\/integrated-control-systems\/<\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation Inc. is an international Control Systems engineering and Systems Integration company delivering reliable automation solutions to the Oil &amp; Gas sector since 1991. INTECH has done projects in 31 countries across 6 continents with regional offices in 13 countries, equipping it with 2000+ engineering man-years of experience. INTECH’s vendor-neutral approach and extensive experience help serve both regional and global customers with the highest standards of quality and reliability.<\/p>\n<p>INTECH covers all traditional asset classes (upstream, midstream &amp; downstream) as well as shale and buoy automation. Its wide range of solutions covers traditional control system automation as well as hydraulic (surface and sub-surface) control system automation and advanced <a style=\"text-decoration: none; color: #616161;\" href=\"http:\/\/www.shapestechnology.com\" target=\"_blank\" rel=\"external noopener\">software solutions<\/a> for operations and asset management. Customers benefit from INTECH’s lump-sum turnkey solutions to save costs and increase plant productivity.<\/p>\n<p>For more information, visit: https:\/\/www.intechww.com\/[\/vc_column_text][\/vc_column][\/vc_row]\n<\/section>","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column][vc_column_text]INTECH’s systems and experts are helping in expanding a key Middle Eastern water plant to improve the drinking water supply in its host region. INTECH’s multi-vendor expertise and its strategically placed manufacturing facilities have enabled it to become the technology partner of choice for major Oil &amp; Gas companies in MEA region. The ever-increasing trust&hellip;<\/p>\n","protected":false},"author":4,"featured_media":7470,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[158,104,167,203],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["2"],"_thumbnail_id":["7470"],"_wpb_vc_js_status":["true"],"_easy_image_gallery_link_images":["off"],"_edit_lock":["1640178018:1"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/7466"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=7466"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/7466\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/7470"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=7466"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=7466"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=7466"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=7466"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}