{"id":8205,"date":"2022-01-14T07:07:54","date_gmt":"2022-01-14T07:07:54","guid":{"rendered":"https:\/\/www.intechww.com\/?p=8205"},"modified":"2022-01-15T20:22:07","modified_gmt":"2022-01-15T20:22:07","slug":"intech-wins-project-for-modernizing-well-site-data-acquisition-via-wireless-field-instrumentation-at-a-major-oil-field-in-middle-east","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intech-wins-project-for-modernizing-well-site-data-acquisition-via-wireless-field-instrumentation-at-a-major-oil-field-in-middle-east","title":{"rendered":"INTECH wins project for modernizing well-site data acquisition via wireless field instrumentation at a major oil field in the Middle East"},"content":{"rendered":"<section class=\"wpb-content-wrapper\">[vc_row][vc_column][vc_column_text]INTECH will help a major regional oil company to modernize well-site data acquisition via wireless field instrumentation at a major oil field in the Middle East.<\/p>\n<p>INTECH, with more than two decades of operations in the region, has become a leading name for reliability and innovation and was awarded the project based on its excellent working relationship with the client as well as experience of working on the said field.<\/p>\n<p>The wellsite data at the oil field was being recorded manually which was affecting evaluation of production profiles and production levels. The client was looking for a solution to have access to real-time data signals, ESP signals, wellhead pressure, flowline pressure, temperature levels, and similar critical information.<\/p>\n<p>INTECH will install a modern Data Acquisition Systems complete with wireless instruments, telemetry systems, Remote Terminal Units, and solar systems along with FOC network for all production wells. INTECH will also provide in-house engineering services &amp; installation, testing, and commissioning supervision services along with training of client personnel.<\/p>\n<p>INTECH’s deployment of a wireless field instrumentation-based data acquisition system will help the client to proactively make decisions about important process parameters such as production profiling, well allocation, and accommodating several wellheads\/flow lines on a single site by utilizing wireless instruments with RTUs.<\/p>\n<p><strong>How we are responding to COVID 19:<\/strong> We are ensuring that our services and business agreements are executed to the satisfaction of our clients and partners without exposing anyone to COVID 19. Our factories are operational with significant new safety measures. We have devised a global COVID 19 plan that covers international movement, precautions, behavioral changes, and contingency &amp; emergency response options for all our business regions.<\/p>\n<p>If you are an INTECH client and have not received information about our business continuity plans, please feel free to reach out to an INTECH account manager or project manager.<\/p>\n<p><strong>About INTECH’s Integrated Control Systems (ICS) Solutions<\/strong><\/p>\n<p>INTECH’s Integrated Control Systems offer a complete array of vendor-neutral control automation and integration solutions ranging from basic Process Control, Safety, F&amp;G, and Power Management applications to data networks, site security, instrument management, and fully integrated control and safety systems. Our third-party start-up and commissioning services ensure minimum downtime and accelerated glitch-free execution. INTECH’s ICS is a “One-Stop Automation Solution” that improves plant safety, reliability, and efficiency while lowering costs and increasing returns.<\/p>\n<p>For more information visit: <a href=\"https:\/\/www.intechww.com\/automation\/integrated-control-systems\/\">https:\/\/www.intechww.com\/automation\/integrated-control-systems\/<\/a><\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation is a globally renowned system integrator and industrial automation company. For nearly 30 years we have helped major oil &amp; gas companies solve their most pressing issues of instrumentation, control, and electrical automation. INTECH’s diversiﬁed automation solution portfolio, technical skills, knowledge, and expertise on equipment from all major OEMs, and our asset-application speciﬁc approach to solution design are what differentiates us from a typical system integrator.<\/p>\n<p>As the world moves towards Industry 4.0, we move along with it and since late 2016, we have focused on building up our expertise on Industrial IoT and related digitalization solutions. We are gradually shifting from a project-based solution provider to a partnership-based solution provider. We have started working closely with our technology and platform partners as well as clients to build long-term relationships where we work together to solve problems and provide solutions that are cost-efficient, time-efficient, and bring the best of what everyone can offer.<\/p>\n<p>For more information, please visit: <a href=\"https:\/\/www.intechww.com\/\">www.intechww.com<\/a>[\/vc_column_text][\/vc_column][\/vc_row]\n<\/section>","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column][vc_column_text]INTECH will help a major regional oil company to modernize well-site data acquisition via wireless field instrumentation at a major oil field in the Middle East. INTECH, with more than two decades of operations in the region, has become a leading name for reliability and innovation and was awarded the project based on its excellent&hellip;<\/p>\n","protected":false},"author":4,"featured_media":8213,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[162,158,204,104,167,157],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["4"],"_wpb_vc_js_status":["true"],"_easy_image_gallery_link_images":["off"],"_edit_lock":["1642279754:4"],"_thumbnail_id":["8213"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/8205"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=8205"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/8205\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/8213"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=8205"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=8205"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=8205"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=8205"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}