{"id":8248,"date":"2022-01-31T12:17:30","date_gmt":"2022-01-31T12:17:30","guid":{"rendered":"https:\/\/www.intechww.com\/?p=8248"},"modified":"2022-01-31T12:17:30","modified_gmt":"2022-01-31T12:17:30","slug":"intechs-project-team-lauded-for-establishing-and-maintaining-centralized-historian-for-manufacturing-facilities-at-a-major-petrochemicals-company-in-gcc-region","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intechs-project-team-lauded-for-establishing-and-maintaining-centralized-historian-for-manufacturing-facilities-at-a-major-petrochemicals-company-in-gcc-region","title":{"rendered":"INTECH’s project team lauded for establishing and maintaining centralized historian for manufacturing facilities at a major petrochemicals company in GCC region"},"content":{"rendered":"<section class=\"wpb-content-wrapper\">[vc_row][vc_column][vc_column_text]INTECH receives outstanding customer satisfaction scores in an annual review of its performance in its long-term partnership agreement with a major petrochemicals company in the GCC region.<\/p>\n<p>INTECH in collaboration with the client’s digitization team is providing services for system integration, maintenance, preventive, and reactive emergency support work on and off-site according to customer requirements.<\/p>\n<p>The client expressed utmost satisfaction with the overall work done for the project. They highly commended the project team&#8217;s work planning, problem-solving, and site reporting.  The client’s representative also gave the highest rating to service engineers’ adherence to site safety standards &amp; practices while lauding their technical knowledge and professionalism.<\/p>\n<p>INTECH’s scope of work covers the establishment and maintenance of a centralized historian for manufacturing facilities, including the following:<\/p>\n<ul>\n<li>Integration of existing and new sites with Corporate PI Servers at Head Office<\/li>\n<li>Development and configuration of PI Asset Framework as per asset hierarchy for all local plants<\/li>\n<li>Design of custom dashboards, graphics for remote monitoring, and decision support<\/li>\n<li>System architecture design and recommendation for each integration as per OSIsoft and customer best practices<\/li>\n<li>PI System software maintenance and upgrades to latest releases<\/li>\n<li>Continuous updates, improvement, and enhancement of software and interfaces<\/li>\n<li>Preventive Maintenance Services and Reactive On-Site Support to customer<\/li>\n<li>Exception based Alerts and Notifications for System Diagnostics<\/li>\n<li>Integration support with Enterprise Data Lake &amp; Business Systems<\/li>\n<li>Security compliance and patching as per requirement and OSIsoft best practices<\/li>\n<li>Technical support, guidance, and recommendations for continuous improvement<\/li>\n<li>Training Program for Personnel<\/li>\n<\/ul>\n<p><strong>How we are responding to COVID 19:<\/strong> We are ensuring that our services and business agreements are executed to the satisfaction of our clients and partners without exposing anyone to COVID 19. Our factories are operational with significant new safety measures. We have devised a global COVID 19 plan that covers international movement, precautions, behavioral changes, and contingency &amp; emergency response options for all our business regions.<\/p>\n<p>If you are an INTECH client and have not received information about our business continuity plans, please feel free to reach out to an INTECH account manager or project manager.<\/p>\n<p><strong>About INTECH Digital Solutions<\/strong><\/p>\n<p>INTECH offers consultancy solutions (consultancy, algorithms, technology) targeting operations, production &amp; maintenance to discover hidden efficiencies in plants’ operating envelope. Working together with the customers, INTECH helps get more out of people, processes, and technology. INTECH’s partners are directly involved with and influence the development of virtually all industry-recognized alarm management standards and other influential documents, including the ISA-18.2 standard, the API-RP-1167 recommended practice, and the EEMUA 191 guideline document.<\/p>\n<p>For more information on INTECH Digital Solutions, click here: <a href=\"https:\/\/www.intechww.com\/digital\/\">https:\/\/www.intechww.com\/digital\/<\/a><\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation Inc. is an international Control Systems engineering and Systems Integration company delivering reliable automation solutions to the Oil &amp; Gas sector since 1991. INTECH has done projects in 31 countries across 6 continents with regional offices in 13 countries, equipping it with 2000+ engineering man-years of experience. INTECH’s vendor-neutral approach and extensive experience help serve both regional and global customers with the highest standards of quality and reliability.<\/p>\n<p>INTECH covers all traditional asset classes (upstream, midstream &amp; downstream) as well as shale and buoy automation. Its wide range of solutions covers traditional control system automation as well as hydraulic (surface and sub-surface) control system automation and advanced software solutions for operations and asset management. Customers benefit from INTECH’s lump-sum turnkey solutions to save costs and increase plant productivity.<\/p>\n<p>For more information, visit: <a href=\"https:\/\/www.intechww.com\/\">https:\/\/www.intechww.com<\/a>[\/vc_column_text][\/vc_column][\/vc_row]\n<\/section>","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column][vc_column_text]INTECH receives outstanding customer satisfaction scores in an annual review of its performance in its long-term partnership agreement with a major petrochemicals company in the GCC region. INTECH in collaboration with the client’s digitization team is providing services for system integration, maintenance, preventive, and reactive emergency support work on and off-site according to customer requirements.&hellip;<\/p>\n","protected":false},"author":4,"featured_media":8249,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[213,154,104,185,195,203],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["4"],"_thumbnail_id":["8249"],"_wpb_vc_js_status":["true"],"_easy_image_gallery_link_images":["off"],"_edit_lock":["1643663181:4"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/8248"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=8248"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/8248\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/8249"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=8248"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=8248"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=8248"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=8248"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}