{"id":8257,"date":"2022-02-08T12:04:08","date_gmt":"2022-02-08T12:04:08","guid":{"rendered":"https:\/\/www.intechww.com\/?p=8257"},"modified":"2022-02-08T12:04:08","modified_gmt":"2022-02-08T12:04:08","slug":"contextualizing-ot-cybersecurity-attacks-the-price-of-recovery","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/contextualizing-ot-cybersecurity-attacks-the-price-of-recovery","title":{"rendered":"Contextualizing OT Cybersecurity: Attacks &#038; the price of recovery"},"content":{"rendered":"<section class=\"wpb-content-wrapper\">[vc_row][vc_column][vc_column_text]OT systems are rigid, deterministic, and complex. They are not as dynamic as IT systems. The critical infrastructure in today’s digitally connected world depends on OT networks which include several devices working together as one system. The failure of even one component is going to have a disastrous ripple effect on other systems. Industrial systems are becoming more and more connected. While this has given a competitive advantage to organizations, these technologies have exposed critical infrastructure to cybersecurity attacks.<\/p>\n<p>There has been an overall increase in OT cybersecurity attacks and breaches. In 2019, IBM reported a staggering 2000% increase in cybersecurity incidents against OT and predicted a  30% increase every year.  In 2020, there were around 32,000 cyber attacks with 4000 breaches. In 2021, total attacks stood at 29,000 but breaches increased to around 5200. There were 585 attacks and 270 breaches in the manufacturing sector. By comparison, there were 48 attacks and 20 breaches in the utility sector. Large scale industrial sector is more vulnerable to being attacked as can be seen by the recent attacks on Colonial Pipeline, JBS Foods, and the Oldsmar, Florida water treatment facility. There was a high proportion of ransomware attacks on the manufacturing sector as they could not afford to have unplanned downtime, and threat actors exploited this vulnerability.<\/p>\n<p>In the past, it was difficult for cyber attackers to access OT systems because of airgaps. Today, industrial systems are connected to corporate networks with the internet which use everything from connected sensors to big data analytics. The OT\/IT convergence, with all the advantages on offer, has also brought about an increase in cyber risks. Moreover, hackers have become more sophisticated and resourceful with emerging technologies.<\/p>\n<p>According to Claroty’s third Biannual ICS Risk &amp; Vulnerability Report, there has been a staggering increase in ICS vulnerabilities. 637 ICS vulnerabilities were reported in the first half of 2021 and in 2020 there were 449 vulnerabilities. There has been a 41% increase in overall vulnerabilities, around 71% of these are classified as critical and 90% are of low complexity. Low complexity vulnerabilities don’t have any special conditions and can occur again.<\/p>\n<p>Industrial environments keep equipment with long lifecycles, which work at full capacity and require little downtime. There are still some OT systems that have components that must be 20-30 years old. These are referred to as OT legacy systems and are the most vulnerable systems as they might be using older software that is no longer secure or supported. These systems have inadequate security measures, and it becomes increasingly difficult to integrate them with modern solutions increasing the risk for attacks.  The figure below shows that the largest number of vulnerabilities exist in operations, basic control, supervisory control, and network devices.[\/vc_column_text][\/vc_column][\/vc_row][vc_row][vc_column]<figure class=\"vcex-image vcex-module textcenter\"><div class=\"vcex-image-inner wpex-relative wpex-inline-block\"><img loading=\"lazy\" class=\"vcex-image-img wpex-align-middle\" decoding=\"async\" src=\"https:\/\/www.intechww.com\/wp-content\/uploads\/Levels-Graph-OTCS-article-1e1-1.png\" alt=\"\" srcset=\"https:\/\/www.intechww.com\/wp-content\/uploads\/Levels-Graph-OTCS-article-1e1-1.png 600w, https:\/\/www.intechww.com\/wp-content\/uploads\/Levels-Graph-OTCS-article-1e1-1-300x169.png 300w\" width=\"600\" height=\"338\"><\/div><\/figure>[\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]According to the World Economic Forum, the average cost of cyber-attacks varies with the type of attacks; the average cost of malware and web-based cyber-attacks is $1.4 million, the average cost of Denial-of-Service is $1.1 million, and the average cost of attacks due to malicious insiders is $1.2 million. A report published by Ponemon Institute shows that an average OT cybersecurity attack costs around $3 million and according to IBM this average attack cost $4.24 million. According to Cybersecurity Ventures, global ransomware damages amounted to $20 billion and are expected to reach 265 billion by 2031. In 2021 it was predicted that a ransomware attack occurred every 11 seconds and by 2031, ransomware will attack a business, device, or consumer every 2 seconds!<\/p>\n<p>The table below shows that on average, it took organizations 170 days to detect an incident, 66 days to investigate it, and 80 days to remediate the incident. According to these calculations, it would cost an organization nearly $1 million in labor alone to get a team of six members to detect, investigate, and remediate an incident. With this, it will take $2 million for downtime, legal costs, regulatory fines, and equipment replacement, resulting in an average total cost of approximately $3 million.[\/vc_column_text][\/vc_column][\/vc_row][vc_row][vc_column]<figure class=\"vcex-image vcex-module textcenter\"><div class=\"vcex-image-inner wpex-relative wpex-inline-block\"><img loading=\"lazy\" class=\"vcex-image-img wpex-align-middle\" decoding=\"async\" src=\"https:\/\/www.intechww.com\/wp-content\/uploads\/Table-OTCS-article-1-e1-1-480x400.png\" alt=\"\" srcset=\"https:\/\/www.intechww.com\/wp-content\/uploads\/Table-OTCS-article-1-e1-1-480x400.png 480w, https:\/\/www.intechww.com\/wp-content\/uploads\/Table-OTCS-article-1-e1-1-300x250.png 300w, https:\/\/www.intechww.com\/wp-content\/uploads\/Table-OTCS-article-1-e1-1-1024x854.png 1024w, https:\/\/www.intechww.com\/wp-content\/uploads\/Table-OTCS-article-1-e1-1-768x641.png 768w, https:\/\/www.intechww.com\/wp-content\/uploads\/Table-OTCS-article-1-e1-1-1536x1281.png 1536w, https:\/\/www.intechww.com\/wp-content\/uploads\/Table-OTCS-article-1-e1-1.png 2000w\" width=\"480\" height=\"400\"><\/div><\/figure>[\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]Organizations need to realize that OT cyberattacks not only cause financial losses, but there could also be loss of property, reputational damage, permanent and irreversible damage to personnel, the environment, and even national security. It has become imperative for organizations to implement OT Cybersecurity programs before it is too late.[\/vc_column_text][\/vc_column][\/vc_row]\n<\/section>","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column][vc_column_text]OT systems are rigid, deterministic, and complex. They are not as dynamic as IT systems. The critical infrastructure in today’s digitally connected world depends on OT networks which include several devices working together as one system. The failure of even one component is going to have a disastrous ripple effect on other systems. Industrial systems&hellip;<\/p>\n","protected":false},"author":4,"featured_media":5493,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[127,207],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_lock":["1648549360:4"],"_edit_last":["4"],"_thumbnail_id":["5493"],"_wpb_vc_js_status":["true"],"_easy_image_gallery_link_images":["off"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/8257"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=8257"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/8257\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/5493"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=8257"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=8257"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=8257"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=8257"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}