{"id":8390,"date":"2022-02-28T12:27:59","date_gmt":"2022-02-28T12:27:59","guid":{"rendered":"https:\/\/www.intechww.com\/?p=8390"},"modified":"2022-03-02T08:02:37","modified_gmt":"2022-03-02T08:02:37","slug":"recognizing-exploitable-ot-vulnerabilities-due-to-it-ot-interconnectedness","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/recognizing-exploitable-ot-vulnerabilities-due-to-it-ot-interconnectedness","title":{"rendered":"Recognizing exploitable OT vulnerabilities due to IT-OT interconnectedness"},"content":{"rendered":"<section class=\"wpb-content-wrapper\">[vc_row][vc_column][vc_column_text]OT systems have mostly been isolated in the past as they largely depended upon closed proprietary protocols and manually operated software to carry out their essential functions. Since these systems were traditionally air-gapped, they enjoyed sufficient hindrance to any infiltration attempts by mal-intentioned hackers, and consequently prevented, or lessened the likelihood of cyberattacks.<\/p>\n<p>However, as the world enters a new phase of interconnectedness and digitalization, lines between OT and IT fade. The OT ecosystem is increasingly adopting IT solutions to enhance functional capabilities and efficiency of their processes. This transition from being isolated to becoming highly integrated with IT exposes cyber vulnerabilities and endangers security of OT systems.<\/p>\n<p>Harmonized working of IT and OT systems may have exposed OT to threats like those faced by IT, however, the associated damage is not the same. OT systems are far more complex. Cyberattacks on these could wreak havoc and have more serious implications because of their connection to the physical world. For this reason, a deep dive into how OT and IT systems compare could help signify the deeper impacts of OT cyber threats.<\/p>\n<p><strong>IT vs OT and IT\/OT Convergence<\/strong><\/p>\n<p>Simply put, IT refers to the technology that is mainly centered around processing data or information. IT systems have evolved over time to manipulate, store, communicate, and protect data, in different forms, with the purpose of carrying out regular business operations.<\/p>\n<p>OT systems, however, involve the use of hardware and software to monitor and control the components that directly impact the physical world. Businesses depend upon this technology in order to automate physical assets and control events in real-time.<\/p>\n<p>It is due to the very nature of OT systems, which involves interactions with the physical world, that the cyber threats pose a much serious risk. This means that not only would the businesses be financially impacted, a cyberattack could easily trigger events endangering human lives in the process.<\/p>\n<p>Hence, it is of utmost importance that safety and availability are labeled as the topmost priorities when cyber-securing the OT systems, followed by integrity and confidentiality. In contrast to this, IT systems require confidentiality as their highest priority. This is subsequently followed by integrity and availability. It is interesting to note how the priorities and terminologies differ in both contexts.<\/p>\n<p>Further differences regarding IT and OT cybersecurity are in order.<\/p>\n<table>\n<tbody>\n<tr>\n<td width=\"200\"><strong>Component<\/strong><\/td>\n<td width=\"200\"><strong>OT<\/strong><\/td>\n<td width=\"200\"><strong>IT<\/strong><\/td>\n<\/tr>\n<tr>\n<td width=\"200\">Availability requirement<\/td>\n<td width=\"200\">Very high<\/td>\n<td width=\"200\">Delays are tolerable<\/td>\n<\/tr>\n<tr>\n<td width=\"200\">Lifespan of the devices<\/td>\n<td width=\"200\">Up to 20 years<\/td>\n<td width=\"200\">3 to 5 years<\/td>\n<\/tr>\n<tr>\n<td width=\"200\">Patching requirement<\/td>\n<td width=\"200\">Infrequent<\/td>\n<td width=\"200\">Frequent and regular<\/td>\n<\/tr>\n<tr>\n<td width=\"200\">Security testing requirement<\/td>\n<td width=\"200\">Infrequent<\/td>\n<td width=\"200\">Scheduled<\/td>\n<\/tr>\n<tr>\n<td width=\"200\">Real-time requirement<\/td>\n<td width=\"200\">Very high<\/td>\n<td width=\"200\">Delays are tolerable<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>IT systems and their corresponding vulnerabilities have been around for years, and the industry has somewhat developed a mature sense of awareness and sound capabilities to prevent or tackle its security problems. With the OT systems however, despite increased awareness due to <a href=\"https:\/\/www.intechww.com\/contextualizing-ot-cybersecurity-attacks-the-price-of-recovery\/\">recent incidents<\/a> achieving a similar level of security <a href=\"https:\/\/www.intechww.com\/investing-in-ot-cybersecurity-recognizing-resolving-organizational-challenges\/\">remains an uphill task<\/a>. This mainly stems from a wide range of factors which contribute towards making OT systems an easy target.<\/p>\n<p>Unlike in IT, devices used in OT environment have been functioning for years without any disruption which gives rise to the fact that much of the technology that is in use belongs to an era which did not have the cybersecurity capabilities needed in today’s world. Simply put, these devices are unable to cope with currently acceptable security controls, like data encryption and strong passwords, which may increase the chances of infiltration and theft. This makes them more vulnerable to attacks as compared to IT systems.<\/p>\n<p>By nature, OT systems offer a fair amount of resistance to protection by allowing certain loopholes.<\/p>\n<ul>\n<li>OT systems excessively lack timely patches as patching can disrupt operations and can only be done during downtimes. Due to lack of proper asset vulnerability management, this becomes an easy entry point for hackers.<\/li>\n<li>Poor network segmentation increases the possibility of attacks as this exposes critical process networks with poor security controls to external infiltration.<\/li>\n<li>Companies frequently use third-party and OEM systems, and risk getting compromised software or unpatched technology components that are susceptible to attacks.<\/li>\n<li>Unauthorized remote access to crucial information further adds to the woes of unsecured OT systems.<\/li>\n<\/ul>\n<p>Hence, the ability to recognize and timely respond to a cyberattack immensely improves your security posture, helping you establish a much-needed level of resilience.<\/p>\n<p>There is no way of eliminating the possibility of infiltration entirely. Attackers will always be innovative enough to keep exploiting various opportunities to enter a system, despite enhancing the cybersecurity levels. The motivation of cyber-threat-actors scales with the time and resources available to them – state-funded groups are a significantly more serious threat to OT systems than hobbyist or activist groups with limited tools, skills, and funding.<\/p>\n<p>Since it is a continuously evolving process, OT dependent businesses need to rise to the challenge, devise a meticulous strategy to mitigate the threats, and plan timely actions and responses in the most efficient and effective manner whenever the need arises.[\/vc_column_text][\/vc_column][\/vc_row]\n<\/section>","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column][vc_column_text]OT systems have mostly been isolated in the past as they largely depended upon closed proprietary protocols and manually operated software to carry out their essential functions. Since these systems were traditionally air-gapped, they enjoyed sufficient hindrance to any infiltration attempts by mal-intentioned hackers, and consequently prevented, or lessened the likelihood of cyberattacks. However, as&hellip;<\/p>\n","protected":false},"author":4,"featured_media":8397,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[127,207],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_lock":["1646208074:4"],"_edit_last":["4"],"_wpb_vc_js_status":["true"],"_easy_image_gallery_link_images":["off"],"_thumbnail_id":["8397"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/8390"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=8390"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/8390\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/8397"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=8390"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=8390"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=8390"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=8390"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}