{"id":8580,"date":"2022-03-21T09:35:42","date_gmt":"2022-03-21T09:35:42","guid":{"rendered":"https:\/\/www.intechww.com\/?p=8580"},"modified":"2022-03-21T09:43:14","modified_gmt":"2022-03-21T09:43:14","slug":"intech-helps-a-major-me-oil-gas-company-improve-its-ot-cybersecurity-posture-by-securing-its-ot-networks","status":"publish","type":"post","link":"https:\/\/www.intechww.com\/intech-helps-a-major-me-oil-gas-company-improve-its-ot-cybersecurity-posture-by-securing-its-ot-networks","title":{"rendered":"INTECH helps a major ME Oil &#038; Gas company improve its OT Cybersecurity posture by securing its OT Networks"},"content":{"rendered":"<section class=\"wpb-content-wrapper\">[vc_row][vc_column][vc_column_text]INTECH is helping one of the major Oil &amp; Gas companies in the Middle East improve its OT Cybersecurity posture by securing its OT Networks.<\/p>\n<p>The client on this project required an OT Network Performance Monitoring Solution which would proactively monitor the performance and availability of ICS equipment including Servers, workstations, and network devices. The solution will provide front end users information to support pipelines engineering and PAN Admin management decision-making process, complying with regional standards and cybersecurity audit requirements.<\/p>\n<p>INTECH’s scope of work covers the provision and implementation of five separate instances of a Network Performance Monitoring system with associated activities including configuration of network devices, setup of user accounts and roles, and system hardening. These systems will be actively tracking and monitoring up to 300 devices across the five OT areas.<\/p>\n<p>INTECH will be managing support for the NPM system for 3 years. Our team will also be performing usual implementation activities on the customer’s site including testing, user orientation, and training.<\/p>\n<p><strong>About INTECH OT Cybersecurity <\/strong><\/p>\n<p>INTECH’s OT Cybersecurity expertise is built on deep-rooted knowledge and over 30 years of experience with complete lifecycle of OT systems design, deployment, management, and upgrades. INTECH’s multi-disciplinary teams of experts, with extensive experience on systems from leading OT system vendors, are helping some of the largest industrial organizations towards a secure digital transformation.<\/p>\n<p>We can help you capture maximum advantage from enhanced connectivity by strengthening the cybersecurity posture of your critical infrastructure &amp; industrial systems through a combination of consolidated visibility &amp; risk management, round-the-clock anomaly &amp; threat detection, OT Network segmentation, and OT systems &amp; network hardening. Our global partnership with leading OT Cybersecurity firms makes sure that our solutions are deployed speedily and integrated seamlessly without any complications.<\/p>\n<p>For more information, please visit: <a href=\"https:\/\/www.intechww.com\/digital\/ot-cybersecurity\/\">https:\/\/www.intechww.com\/digital\/ot-cybersecurity\/<\/a><\/p>\n<p><strong>About INTECH<\/strong><\/p>\n<p>INTECH Process Automation is a globally renowned system integrator and industrial automation company. For nearly 30 years we have helped major oil &amp; gas companies solve their most pressing issues of instrumentation, control, and electrical automation. INTECH’s diversiﬁed automation solution portfolio, technical skills, knowledge, and expertise on equipment from all major OEMs, and our asset-application speciﬁc approach to solution design are what differentiates us from a typical system integrator.<\/p>\n<p>As the world moves towards Industry 4.0, we move along with it and since late 2016, we have focused on building up our expertise on Industrial IoT and related digitalization solutions. We are gradually shifting from a project-based solution provider to a partnership-based solution provider. We have started working closely with our technology and platform partners as well as clients to build long-term relationships where we work together to solve problems and provide solutions that are cost-efficient, time-efficient, and bring the best of what everyone can offer.<\/p>\n<p>For more information, please visit: <a href=\"https:\/\/www.intechww.com\/\">www.intechww.com<\/a>[\/vc_column_text][\/vc_column][\/vc_row]\n<\/section>","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column][vc_column_text]INTECH is helping one of the major Oil &amp; Gas companies in the Middle East improve its OT Cybersecurity posture by securing its OT Networks. The client on this project required an OT Network Performance Monitoring Solution which would proactively monitor the performance and availability of ICS equipment including Servers, workstations, and network devices. The&hellip;<\/p>\n","protected":false},"author":4,"featured_media":8584,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[104,207,203],"tags":[],"post_series":[],"cp_meta_data":{"inline_featured_image":["0"],"_edit_last":["4"],"_wpb_vc_js_status":["true"],"_easy_image_gallery_link_images":["off"],"_edit_lock":["1647857336:4"],"_thumbnail_id":["8584"]},"_links":{"self":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/8580"}],"collection":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/comments?post=8580"}],"version-history":[{"count":0,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/posts\/8580\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media\/8584"}],"wp:attachment":[{"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/media?parent=8580"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/categories?post=8580"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/tags?post=8580"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/www.intechww.com\/wp-json\/wp\/v2\/post_series?post=8580"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}